{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "Ġt": 256,
      "Ġa": 257,
      "he": 258,
      "Ġâ": 259,
      "Ġi": 260,
      "on": 261,
      "Ġthe": 262,
      "ti": 263,
      "re": 264,
      "Ġs": 265,
      "Ġ(": 266,
      "Ġo": 267,
      "Ġc": 268,
      "in": 269,
      "er": 270,
      "ĠâĪ": 271,
      "Ġf": 272,
      "or": 273,
      "Ġw": 274,
      "en": 275,
      "Ġp": 276,
      "Ġof": 277,
      "nd": 278,
      "at": 279,
      "Ġ1": 280,
      "tion": 281,
      "al": 282,
      "Ġd": 283,
      "Ġb": 284,
      "es": 285,
      "ĠÎ": 286,
      "Ġ2": 287,
      "Ġn": 288,
      "Ġin": 289,
      "ed": 290,
      "Ġm": 291,
      "ro": 292,
      "Ġ=": 293,
      "Ġand": 294,
      "it": 295,
      "Ġis": 296,
      "Ġth": 297,
      "ar": 298,
      "Ġe": 299,
      "ĠT": 300,
      "an": 301,
      "Ġ)": 302,
      "le": 303,
      "is": 304,
      "Ġ,": 305,
      "ĠâĪĴ": 306,
      "Ġ.": 307,
      "Ġto": 308,
      "ing": 309,
      "ic": 310,
      "Ġ0": 311,
      "ĠÏ": 312,
      "et": 313,
      "Ġthat": 314,
      "om": 315,
      "Ġfor": 316,
      "ĠâĢ": 317,
      "ve": 318,
      "Ġre": 319,
      "as": 320,
      "ly": 321,
      "Ġh": 322,
      "Ġg": 323,
      "Ġ+": 324,
      "Ġl": 325,
      "Ġu": 326,
      "ation": 327,
      "ec": 328,
      "Ġcon": 329,
      "Ġwe": 330,
      "ll": 331,
      "âĪ": 332,
      "ac": 333,
      "ent": 334,
      "Ġk": 335,
      "ĠA": 336,
      "ĠS": 337,
      "ĠThe": 338,
      "ĠL": 339,
      "st": 340,
      "ow": 341,
      "si": 342,
      "Ġv": 343,
      "ĠI": 344,
      "Ġon": 345,
      "ĠF": 346,
      "ith": 347,
      "Ġpro": 348,
      "im": 349,
      "Ġq": 350,
      "ĠC": 351,
      "ce": 352,
      "ot": 353,
      "ĠP": 354,
      "ou": 355,
      "Ġbe": 356,
      "Ġsu": 357,
      "Ġ[": 358,
      "Ġr": 359,
      "ĠâĪĪ": 360,
      "Ġâī": 361,
      "Ġas": 362,
      "Ġx": 363,
      "se": 364,
      "ul": 365,
      "Ġwith": 366,
      "Ġan": 367,
      "ĠR": 368,
      "ol": 369,
      "Ġby": 370,
      "Ġj": 371,
      "ĠW": 372,
      "Ġ3": 373,
      "ĠN": 374,
      "ĠâĢ²": 375,
      "Ġst": 376,
      "Ġex": 377,
      "qu": 378,
      "ĠB": 379,
      "am": 380,
      "ver": 381,
      "ĠH": 382,
      "Ġ|": 383,
      "ĠM": 384,
      "ig": 385,
      "ĠâĢ¢": 386,
      "ore": 387,
      "ts": 388,
      "od": 389,
      "um": 390,
      "âĪĴ": 391,
      "ri": 392,
      "Ġare": 393,
      "ur": 394,
      "Ġde": 395,
      "ĠE": 396,
      "ut": 397,
      "ĠG": 398,
      "ab": 399,
      "em": 400,
      "ĠD": 401,
      "Ġcom": 402,
      "ch": 403,
      "ain": 404,
      ").": 405,
      "res": 406,
      "pp": 407,
      "ity": 408,
      "),": 409,
      "Ġal": 410,
      "ĠX": 411,
      "ction": 412,
      "tic": 413,
      "il": 414,
      "ate": 415,
      "Ġâī¤": 416,
      "tin": 417,
      "Ġwh": 418,
      "Ġwhe": 419,
      "ap": 420,
      "Ġ*": 421,
      "fin": 422,
      "iv": 423,
      "Ġpo": 424,
      "Ġ4": 425,
      "Ġthis": 426,
      "ct": 427,
      "el": 428,
      "ter": 429,
      "Ġcan": 430,
      "Ġ:": 431,
      "Ġcomp": 432,
      "ĠWe": 433,
      "if": 434,
      "ir": 435,
      "ure": 436,
      "Ġha": 437,
      "ge": 438,
      "un": 439,
      "ĠÎ±": 440,
      "ĨĴ": 441,
      "Ġy": 442,
      "tive": 443,
      "rom": 444,
      "oll": 445,
      "ĠâĬ": 446,
      "Ġï": 447,
      "pl": 448,
      "Ġï£": 449,
      "ĠK": 450,
      "ich": 451,
      "ĠIn": 452,
      "Ġor": 453,
      "ting": 454,
      "Ġle": 455,
      "her": 456,
      "te": 457,
      "id": 458,
      "Ġall": 459,
      "ĠÂ": 460,
      "Ġwhich": 461,
      "Ġfrom": 462,
      "iz": 463,
      "ĠV": 464,
      "per": 465,
      "Ġres": 466,
      "Ġhave": 467,
      "us": 468,
      "Ġif": 469,
      "Ġsp": 470,
      "ĠO": 471,
      "Ġ{": 472,
      "og": 473,
      "ollow": 474,
      "ĠâĨĴ": 475,
      "ad": 476,
      "Ġwhere": 477,
      "ition": 478,
      "orm": 479,
      "Ġnot": 480,
      "Ġfollow": 481,
      "Ġit": 482,
      "Ġz": 483,
      "ay": 484,
      "Ġat": 485,
      "Ġdis": 486,
      "ĠâĦ": 487,
      "Ġset": 488,
      "Ġpar": 489,
      "ĠÎ»": 490,
      "ĠâĪ¥": 491,
      "ma": 492,
      "Ġse": 493,
      "Ġsh": 494,
      "sion": 495,
      "ble": 496,
      "Ġus": 497,
      "der": 498,
      "ence": 499,
      "ari": 500,
      "ĠTh": 501,
      "orem": 502,
      "ect": 503,
      "ĠU": 504,
      "Ġdefin": 505,
      "of": 506,
      "ally": 507,
      "po": 508,
      "end": 509,
      "unction": 510,
      "ess": 511,
      "Ġsuch": 512,
      "oc": 513,
      "ant": 514,
      "ach": 515,
      "ations": 516,
      "Ġun": 517,
      "Ġtr": 518,
      "Ġch": 519,
      "ener": 520,
      "ection": 521,
      "tain": 522,
      "Ġcl": 523,
      "Ġfunction": 524,
      "ĠLet": 525,
      "Ġequ": 526,
      "ound": 527,
      "Ġob": 528,
      "Ġapp": 529,
      "all": 530,
      "ase": 531,
      "Ġthen": 532,
      "ple": 533,
      "ĠPro": 534,
      "Ġco": 535,
      "ution": 536,
      "ere": 537,
      "ary": 538,
      "able": 539,
      "ment": 540,
      "str": 541,
      "ies": 542,
      "ĠÃ": 543,
      "ated": 544,
      "Ġâī¥": 545,
      "du": 546,
      "act": 547,
      "ĠQ": 548,
      "ĠÏĥ": 549,
      "igh": 550,
      "Ġthere": 551,
      "ĠÂµ": 552,
      "Ġ>": 553,
      "rou": 554,
      "Ġ5": 555,
      "Ġne": 556,
      "and": 557,
      "ĠZ": 558,
      "Ġ<": 559,
      "Ġsub": 560,
      "ĠÎ²": 561,
      "tim": 562,
      "ĠÎ³": 563,
      "ĠFor": 564,
      "Ġone": 565,
      "ite": 566,
      "ace": 567,
      "Ġbound": 568,
      "Ġmod": 569,
      "erm": 570,
      "Ġma": 571,
      "ĠTheorem": 572,
      "ine": 573,
      "ĠÎ´": 574,
      "ati": 575,
      "ĠâĪŀ": 576,
      "ther": 577,
      "Ġgener": 578,
      "Ġsy": 579,
      "Ġqu": 580,
      "ond": 581,
      "Ġim": 582,
      "ĠY": 583,
      "Ġany": 584,
      "Ġtw": 585,
      "Ġhas": 586,
      "ill": 587,
      "sition": 588,
      "Ġform": 589,
      "ber": 590,
      "Ġass": 591,
      "Ġind": 592,
      "Ġgiv": 593,
      "Ġshow": 594,
      "alu": 595,
      "Ġresul": 596,
      "Ġver": 597,
      "ric": 598,
      "))": 599,
      "ĠÎµ": 600,
      "ĠÏģ": 601,
      "Ġeach": 602,
      "ome": 603,
      "ĠâĪĤ": 604,
      "Ġtwo": 605,
      "Ġpoin": 606,
      "ous": 607,
      "ĠÎ¸": 608,
      "].": 609,
      "ĠThis": 610,
      "ff": 611,
      "so": 612,
      "emma": 613,
      "ĠÏĦ": 614,
      "ince": 615,
      "form": 616,
      "os": 617,
      "th": 618,
      "Ġsim": 619,
      "Ġfin": 620,
      "ds": 621,
      "ĠÏĢ": 622,
      "ose": 623,
      "ĠLemma": 624,
      "ular": 625,
      "gor": 626,
      "ĠâĦĵ": 627,
      "Ġcase": 628,
      "ial": 629,
      "Ġnum": 630,
      "Ġad": 631,
      "rib": 632,
      "Ġden": 633,
      "ĠÃĹ": 634,
      "Î±": 635,
      "dition": 636,
      "Ġab": 637,
      "],": 638,
      "Ġexp": 639,
      "Ġwill": 640,
      "ree": 641,
      "Ġar": 642,
      "iff": 643,
      "ame": 644,
      "Ġfollowing": 645,
      "Ġstr": 646,
      "Ġgr": 647,
      "Ġmat": 648,
      "Ġsol": 649,
      "Ġme": 650,
      "Ġnon": 651,
      "Ġ6": 652,
      "âĪ¥": 653,
      "ans": 654,
      "irst": 655,
      "ĠJ": 656,
      "ote": 657,
      "eren": 658,
      "ical": 659,
      "Ł©": 660,
      "ĠThen": 661,
      "ud": 662,
      "Ġ),": 663,
      "Ġonly": 664,
      "gr": 665,
      "Ġsome": 666,
      "aph": 667,
      "Ġalso": 668,
      "ator": 669,
      "Ġcor": 670,
      "âĪĪ": 671,
      "Ġdiff": 672,
      "Ġfi": 673,
      "ep": 674,
      "ithm": 675,
      "position": 676,
      "Ġint": 677,
      "Ġgiven": 678,
      "ates": 679,
      "cl": 680,
      "ak": 681,
      "Ġtim": 682,
      "âĢ": 683,
      "ight": 684,
      "Ġ]": 685,
      "Ġ}": 686,
      "abil": 687,
      "etw": 688,
      "blem": 689,
      "ers": 690,
      "Ġnumber": 691,
      "ass": 692,
      "Ġinter": 693,
      "ance": 694,
      "Ġexis": 695,
      "ĠÎĵ": 696,
      "ĠFig": 697,
      "ĠÏķ": 698,
      "Ġ).": 699,
      "ire": 700,
      "Ġdist": 701,
      "ph": 702,
      "Ġes": 703,
      "resent": 704,
      "atis": 705,
      "Ġpre": 706,
      "enti": 707,
      "Ġvari": 708,
      "sider": 709,
      "âĦ": 710,
      "Ġ-": 711,
      "Ġmin": 712,
      "ork": 713,
      "gorithm": 714,
      "Ġlog": 715,
      "ĠÏī": 716,
      "ra": 717,
      "Ġproblem": 718,
      "ĠÏµ": 719,
      "Ġfollows": 720,
      "Ġassum": 721,
      "ension": 722,
      "xim": 723,
      "Ġobtain": 724,
      "Ġ:=": 725,
      "Ġcomple": 726,
      "Ġmodel": 727,
      "Ġfirst": 728,
      "ĠâĪĨ": 729,
      "ative": 730,
      "ĠIf": 731,
      "Ġop": 732,
      "Ġ/": 733,
      "Ġcondition": 734,
      "Ġso": 735,
      "ard": 736,
      "roup": 737,
      "Î»": 738,
      "ges": 739,
      "ĠÎ·": 740,
      "Ġrel": 741,
      "ĠÏĨ": 742,
      "Ġour": 743,
      "ient": 744,
      "Ł¨": 745,
      "Ġno": 746,
      "ong": 747,
      "ctor": 748,
      "op": 749,
      "Ġmet": 750,
      "Ġvalu": 751,
      "ves": 752,
      "Ġinte": 753,
      "Ġtime": 754,
      "Ġconstr": 755,
      "resp": 756,
      "ty": 757,
      "stem": 758,
      "atisf": 759,
      "uct": 760,
      "orph": 761,
      "Ġover": 762,
      "ability": 763,
      ".,": 764,
      "ĠProof": 765,
      "Ġsatisf": 766,
      "Ġproof": 767,
      "ĠAs": 768,
      "ality": 769,
      "Ġother": 770,
      "Ġcont": 771,
      "oth": 772,
      "Ġdes": 773,
      "ise": 774,
      "ties": 775,
      "Ġappro": 776,
      "Ġhe": 777,
      "Ġgraph": 778,
      "Ġwhen": 779,
      "Ġper": 780,
      "Ġrep": 781,
      "ĠÎ¾": 782,
      "Ġsc": 783,
      "ĠâĦ¦": 784,
      "Ġdifferen": 785,
      "very": 786,
      "Ġac": 787,
      "Ġsm": 788,
      "Ġsystem": 789,
      "ffic": 790,
      "ĠÏĪ": 791,
      "ective": 792,
      "Ġlet": 793,
      "Ġid": 794,
      "Ġsolution": 795,
      "ðĿ": 796,
      "Ġspace": 797,
      "Ġits": 798,
      "ust": 799,
      "Ġterm": 800,
      "ang": 801,
      "ĠÎ½": 802,
      "yp": 803,
      "Ġresp": 804,
      "Ġalgorithm": 805,
      "Ġdet": 806,
      "Ġline": 807,
      "ĠâĬĹ": 808,
      "ie": 809,
      "ast": 810,
      "Ġpoint": 811,
      "Ġ\"": 812,
      "Ġdo": 813,
      "fore": 814,
      "Ġdefined": 815,
      "ort": 816,
      "ove": 817,
      "Ġuse": 818,
      "ĠIt": 819,
      "ism": 820,
      "Ġorder": 821,
      "gh": 822,
      "sis": 823,
      "Ġev": 824,
      "Ġtrans": 825,
      "Ġconsider": 826,
      "ample": 827,
      "Ġmap": 828,
      "ue": 829,
      "Ġfact": 830,
      "imension": 831,
      "nder": 832,
      "Ġevery": 833,
      "Ġsame": 834,
      "respond": 835,
      "Ġve": 836,
      "Ġreg": 837,
      "ord": 838,
      "Ġoper": 839,
      "ces": 840,
      "lement": 841,
      "ced": 842,
      "Ġen": 843,
      "Ġhol": 844,
      "ied": 845,
      "Ġcorrespond": 846,
      "ĠFigure": 847,
      "Ġthese": 848,
      "Î¸": 849,
      "ÏĢ": 850,
      "Ġusing": 851,
      "Ġproper": 852,
      "Ġlim": 853,
      "Ġgeneral": 854,
      "vi": 855,
      "amet": 856,
      "Ġdec": 857,
      "ark": 858,
      "Ġprov": 859,
      "Ġestim": 860,
      "Ġ7": 861,
      "omorph": 862,
      "Ġclass": 863,
      "ÏĦ": 864,
      "âŁ©": 865,
      "ost": 866,
      "ĠProposition": 867,
      "ser": 868,
      "rix": 869,
      "ents": 870,
      "00": 871,
      "ld": 872,
      "Ġro": 873,
      "Ì¸": 874,
      "ĠBy": 875,
      "ion": 876,
      "Ġout": 877,
      "Ġgroup": 878,
      "Ġfinite": 879,
      "Ġed": 880,
      "ĠâĪļ": 881,
      "Ġdistrib": 882,
      "Âµ": 883,
      "Î²": 884,
      "ĠâŁ¨": 885,
      "Ġext": 886,
      "ĠÎ£": 887,
      "een": 888,
      "Ġcomput": 889,
      "etween": 890,
      "ĠSince": 891,
      "Ġ8": 892,
      "ack": 893,
      "Ġbetween": 894,
      "now": 895,
      "ia": 896,
      "cess": 897,
      "Ġdisc": 898,
      "Ïĥ": 899,
      "Ġloc": 900,
      "our": 901,
      "ization": 902,
      "Ġunder": 903,
      "au": 904,
      "Ġprob": 905,
      "ption": 906,
      "les": 907,
      "Ġbas": 908,
      "Î³": 909,
      "Ġpl": 910,
      "Ġmeas": 911,
      "Ġsubs": 912,
      "Ġmatrix": 913,
      "Ġvector": 914,
      "ĠThere": 915,
      "'s": 916,
      "Ġelement": 917,
      "Ġrec": 918,
      "fficient": 919,
      "Ġthan": 920,
      "Ġresult": 921,
      "efin": 922,
      "ĠâĪ©": 923,
      "Ġresults": 924,
      "Ġanal": 925,
      "are": 926,
      "Ġabove": 927,
      "Ġpartic": 928,
      "Ġsee": 929,
      "Ġmore": 930,
      "ould": 931,
      "tial": 932,
      "Ġsequ": 933,
      "Ġconst": 934,
      "Ġdat": 935,
      "ign": 936,
      "Ġexists": 937,
      "10": 938,
      "âĪŀ": 939,
      "hod": 940,
      "geb": 941,
      "xt": 942,
      "âĢ¢": 943,
      "plic": 944,
      "ĠSection": 945,
      "ide": 946,
      "ĠÌ¸": 947,
      "Ġrepresent": 948,
      "Ġcontain": 949,
      "ĠÎ¦": 950,
      "age": 951,
      "ĠCon": 952,
      "ize": 953,
      "mm": 954,
      "ted": 955,
      "Ġsince": 956,
      "Ġparamet": 957,
      "iqu": 958,
      "ĠÎĽ": 959,
      "Ġman": 960,
      "ulti": 961,
      "Ġmethod": 962,
      "ip": 963,
      "out": 964,
      "ĠâĬĤ": 965,
      "andom": 966,
      "Ġbut": 967,
      "Ġoptim": 968,
      "ke": 969,
      "Ġpoly": 970,
      "ðĿĳ": 971,
      "ever": 972,
      "Ġcur": 973,
      "Ġï£´": 974,
      "Ïģ": 975,
      "Ġ;": 976,
      "Ġlar": 977,
      "ian": 978,
      "Ġdistribution": 979,
      "nt": 980,
      "ized": 981,
      "Ġdefine": 982,
      "vari": 983,
      "Ġâĸ": 984,
      "Ġmay": 985,
      "Ġsection": 986,
      "Î´": 987,
      "Ġdenote": 988,
      "ival": 989,
      "ilar": 990,
      "Ġlinear": 991,
      "Ġrandom": 992,
      "ĠÎº": 993,
      "Î¾": 994,
      "ann": 995,
      "11": 996,
      "est": 997,
      "Ġtyp": 998,
      "âĨĴ": 999,
      "Ġfunctions": 1000,
      "Ġstate": 1001,
      "Ġdep": 1002,
      "sitive": 1003,
      "Ġmulti": 1004,
      "tical": 1005,
      "Ġsec": 1006,
      "ower": 1007,
      "âī": 1008,
      "Ġprobability": 1009,
      "Ġpoints": 1010,
      "ected": 1011,
      "equ": 1012,
      "Ġoperator": 1013,
      "âĦ¦": 1014,
      "Ġinto": 1015,
      "sed": 1016,
      "Ġsmall": 1017,
      "ĠThus": 1018,
      "rodu": 1019,
      "Ġ))": 1020,
      "Ġpr": 1021,
      "bit": 1022,
      "Ġconver": 1023,
      "olog": 1024,
      "Ġprove": 1025,
      "Ġstruct": 1026,
      "pt": 1027,
      "Ġused": 1028,
      "ory": 1029,
      "Ġpat": 1030,
      "air": 1031,
      "low": 1032,
      "Ġminim": 1033,
      "tinu": 1034,
      "ĠTo": 1035,
      "Ġmax": 1036,
      "ors": 1037,
      "12": 1038,
      "vel": 1039,
      "ĠSu": 1040,
      "Ġdefinition": 1041,
      "Ġparticular": 1042,
      "Ġdesc": 1043,
      "Ġdata": 1044,
      "Ġtak": 1045,
      "int": 1046,
      "Ġcho": 1047,
      "Ġboth": 1048,
      "ating": 1049,
      "ĠDefin": 1050,
      "Ġnorm": 1051,
      "Ġcol": 1052,
      "Ġimp": 1053,
      "Ġrem": 1054,
      "Ġprocess": 1055,
      ")|": 1056,
      "ero": 1057,
      "Ġnow": 1058,
      "Ġconstant": 1059,
      "uction": 1060,
      "Ġsupp": 1061,
      "Ġknow": 1062,
      "Ġanaly": 1063,
      "Ïī": 1064,
      "ĠNote": 1065,
      "Ġfix": 1066,
      "Ġconn": 1067,
      "gebra": 1068,
      "Îµ": 1069,
      "Ġcomplex": 1070,
      "omial": 1071,
      "Ġequival": 1072,
      "Ġmeasure": 1073,
      "Ġdeg": 1074,
      "over": 1075,
      "Ġbec": 1076,
      "ĠÄ": 1077,
      "Ġinc": 1078,
      "Ġtri": 1079,
      "Ġtheorem": 1080,
      "ication": 1081,
      "Ġformul": 1082,
      "ures": 1083,
      "etric": 1084,
      "Ġimpl": 1085,
      "Ġem": 1086,
      "Ġnod": 1087,
      "Ġwell": 1088,
      "Ġpap": 1089,
      "sible": 1090,
      "ail": 1091,
      "ĠâĪª": 1092,
      "ix": 1093,
      "ual": 1094,
      "par": 1095,
      "ving": 1096,
      "epend": 1097,
      "Ġdire": 1098,
      "Ġpos": 1099,
      "Ġwork": 1100,
      "Ġassume": 1101,
      "Ġsequence": 1102,
      "ĠAl": 1103,
      "omorphism": 1104,
      "âĢ²": 1105,
      "Ġcorresponding": 1106,
      "clud": 1107,
      "Ã©": 1108,
      "Ġdifferent": 1109,
      "Ġ10": 1110,
      "Ġequation": 1111,
      "Ġobser": 1112,
      "Ġvalue": 1113,
      "sing": 1114,
      "ĠâĪĩ": 1115,
      "Ġholds": 1116,
      "aces": 1117,
      "Ġimplies": 1118,
      "Ġcall": 1119,
      "Ġprodu": 1120,
      "Ġpositive": 1121,
      "Ġder": 1122,
      "Ġsecond": 1123,
      "ĠâŁ©": 1124,
      "Ġneed": 1125,
      "owever": 1126,
      "Ġmaxim": 1127,
      "ne": 1128,
      "Ġcomm": 1129,
      "Ïķ": 1130,
      "Ġsing": 1131,
      "ob": 1132,
      "Ġsur": 1133,
      "Ġpaper": 1134,
      "formation": 1135,
      "âĦĵ": 1136,
      "ile": 1137,
      "ten": 1138,
      "ject": 1139,
      "Ġup": 1140,
      "Ġag": 1141,
      "Ġdepend": 1142,
      "Ġreal": 1143,
      "put": 1144,
      "Ġ9": 1145,
      "Ġspec": 1146,
      "Ġ\\": 1147,
      "see": 1148,
      "ĠÏĩ": 1149,
      "Ġcontinu": 1150,
      "ii": 1151,
      "Ġij": 1152,
      "ĠâĪ¼": 1153,
      "Ġapproxim": 1154,
      "Ġdoes": 1155,
      "Ġexample": 1156,
      "Ġrequ": 1157,
      "Î·": 1158,
      "Ġwas": 1159,
      "urther": 1160,
      "Ġer": 1161,
      "als": 1162,
      "tex": 1163,
      "ique": 1164,
      "Ġpair": 1165,
      "tices": 1166,
      "Ġdimension": 1167,
      "ved": 1168,
      "old": 1169,
      "ases": 1170,
      "ĠâĬĨ": 1171,
      "Ġappl": 1172,
      "Ġmost": 1173,
      "13": 1174,
      "Ġtheir": 1175,
      "ause": 1176,
      "ĠMore": 1177,
      "Ġchar": 1178,
      "Ġredu": 1179,
      "Ġinequ": 1180,
      "nomial": 1181,
      "ive": 1182,
      "ampl": 1183,
      "Ġbounded": 1184,
      "eld": 1185,
      "ice": 1186,
      "ependent": 1187,
      "Ġâĸ¡": 1188,
      "ĥĹ": 1189,
      "Ġpath": 1190,
      "Ġstud": 1191,
      "Ġterms": 1192,
      "ood": 1193,
      "Ġcompon": 1194,
      "ectively": 1195,
      "Ġsign": 1196,
      ")(": 1197,
      "Ġâĭ": 1198,
      "Ġet": 1199,
      "Ġdeterm": 1200,
      "Ġstructure": 1201,
      "ĠTherefore": 1202,
      "wise": 1203,
      "ger": 1204,
      "Ġpresent": 1205,
      "Ġ(âĪĴ": 1206,
      "Ġlarge": 1207,
      "Ġpolynomial": 1208,
      "ens": 1209,
      "nce": 1210,
      "Ġstep": 1211,
      "Ġinst": 1212,
      "etwork": 1213,
      "Ġacc": 1214,
      "Ġclos": 1215,
      "Ġidenti": 1216,
      "Ġget": 1217,
      "ĠðĿĳ": 1218,
      "Ġintrodu": 1219,
      "Ġsatisfy": 1220,
      "hed": 1221,
      "Ġref": 1222,
      "ĠDefinition": 1223,
      "Ġintegr": 1224,
      "Ġhom": 1225,
      "oci": 1226,
      "ĠHence": 1227,
      "gy": 1228,
      "Ïµ": 1229,
      "Ġarg": 1230,
      "ĠÎ¶": 1231,
      "sum": 1232,
      "Î½": 1233,
      "Ġvertices": 1234,
      "ex": 1235,
      "ry": 1236,
      "Ġobtained": 1237,
      "ables": 1238,
      "ÏĪ": 1239,
      "ough": 1240,
      "ily": 1241,
      "Ġexist": 1242,
      "âĪĨ": 1243,
      "20": 1244,
      "Ġwr": 1245,
      "14": 1246,
      "Ġvertex": 1247,
      "Ġvalues": 1248,
      "Ġlat": 1249,
      "ĠâĢ²âĢ²": 1250,
      "Ġsimilar": 1251,
      "Ġdenot": 1252,
      "Ġran": 1253,
      "Ġboundary": 1254,
      "loc": 1255,
      "ks": 1256,
      "eng": 1257,
      "15": 1258,
      "Ġnetwork": 1259,
      "Ġ12": 1260,
      "not": 1261,
      "Ġdom": 1262,
      "Ġalgebra": 1263,
      "its": 1264,
      "Ġassumption": 1265,
      "sid": 1266,
      "Ġconditions": 1267,
      "Ġlocal": 1268,
      "Ġdia": 1269,
      "Ġfind": 1270,
      "Ġent": 1271,
      "ays": 1272,
      "Ġfixed": 1273,
      "ered": 1274,
      "action": 1275,
      "acter": 1276,
      "gram": 1277,
      "ech": 1278,
      "ell": 1279,
      "Ġassoci": 1280,
      "me": 1281,
      "Ġerr": 1282,
      "rough": 1283,
      "vious": 1284,
      ")-": 1285,
      "Ġtype": 1286,
      "Ġperform": 1287,
      "Ġbeen": 1288,
      "ft": 1289,
      "ature": 1290,
      "eed": 1291,
      "istic": 1292,
      "ÏĨ": 1293,
      "Ġend": 1294,
      "Ġzero": 1295,
      "aus": 1296,
      "ĠNow": 1297,
      "Ġindependent": 1298,
      "Ġrespectively": 1299,
      "Ġdescrib": 1300,
      "valu": 1301,
      "Ġleast": 1302,
      "ational": 1303,
      "Ġsatisfies": 1304,
      "ist": 1305,
      "Ġá": 1306,
      "ollary": 1307,
      "Ġfr": 1308,
      "ern": 1309,
      "Îĵ": 1310,
      "Ġedge": 1311,
      "âī¤": 1312,
      "Ġrespect": 1313,
      "ov": 1314,
      "Ġderiv": 1315,
      "ential": 1316,
      "ically": 1317,
      "Ġcharacter": 1318,
      "16": 1319,
      "Ġthey": 1320,
      "Ġinf": 1321,
      "Ġsymm": 1322,
      "Ġeig": 1323,
      "tice": 1324,
      "hen": 1325,
      "ength": 1326,
      "und": 1327,
      "ull": 1328,
      "ĠHowever": 1329,
      "yn": 1330,
      "Ġâ©": 1331,
      "cy": 1332,
      "Ġinequality": 1333,
      "Ġoptimal": 1334,
      "Ġsize": 1335,
      "ĠâĨ": 1336,
      "Ġcontr": 1337,
      "..": 1338,
      "Ġsets": 1339,
      "vers": 1340,
      "ĠSupp": 1341,
      "ym": 1342,
      "Ġge": 1343,
      "ness": 1344,
      "ĠRem": 1345,
      "con": 1346,
      "âĪĩ": 1347,
      "Ġexact": 1348,
      "Ġequivalent": 1349,
      "ĠÂ±": 1350,
      "Ġtop": 1351,
      "tr": 1352,
      "vex": 1353,
      "iform": 1354,
      "âĪĤ": 1355,
      "here": 1356,
      "hes": 1357,
      "bin": 1358,
      "Ġmust": 1359,
      "inc": 1360,
      "Ġmain": 1361,
      "ish": 1362,
      "Ġsum": 1363,
      "Ġstand": 1364,
      "Ġeigen": 1365,
      "Ġcontinuous": 1366,
      "ib": 1367,
      "Ġtheory": 1368,
      "19": 1369,
      "ĠâĪ§": 1370,
      "Ġini": 1371,
      "Ġsimple": 1372,
      "Ġaut": 1373,
      "ag": 1374,
      "ĠâĪĢ": 1375,
      "Ġthus": 1376,
      "Ġright": 1377,
      "Ġsubset": 1378,
      "ooth": 1379,
      "Ġph": 1380,
      "ĠÎ¨": 1381,
      "atur": 1382,
      "Ġaf": 1383,
      "Ġsup": 1384,
      "ĠAssum": 1385,
      "Ġcou": 1386,
      "}.": 1387,
      "Ġconsis": 1388,
      "Ġexpres": 1389,
      "ĠCor": 1390,
      "17": 1391,
      "Ġnew": 1392,
      "Ġdetermin": 1393,
      "Ġhy": 1394,
      "iction": 1395,
      "Ġshown": 1396,
      "sequ": 1397,
      "Ġcod": 1398,
      "ule": 1399,
      "gence": 1400,
      "Ġedges": 1401,
      "ĠRemark": 1402,
      "ology": 1403,
      "Ġpossible": 1404,
      "Ġpropo": 1405,
      "Ġvariables": 1406,
      "Ġconstrain": 1407,
      "ĠMoreover": 1408,
      "Ġproperties": 1409,
      "Ġelements": 1410,
      "Ġmon": 1411,
      "Ġunique": 1412,
      "ĠâĥĹ": 1413,
      "Ġbecause": 1414,
      "ĠSuppose": 1415,
      "Ġproperty": 1416,
      "lying": 1417,
      "Ġlength": 1418,
      "Ġeas": 1419,
      "Ġeven": 1420,
      "ĠÅ": 1421,
      "Ġlimit": 1422,
      "Ġthree": 1423,
      "Ġaction": 1424,
      "Ġhand": 1425,
      "Ġinfin": 1426,
      "ful": 1427,
      "variant": 1428,
      "Ġ20": 1429,
      "Ġam": 1430,
      "imensional": 1431,
      "ning": 1432,
      "Ġincre": 1433,
      "round": 1434,
      "ike": 1435,
      "get": 1436,
      "Ġindu": 1437,
      "ĠEx": 1438,
      "Ġdegree": 1439,
      "Ġwould": 1440,
      "ement": 1441,
      "Ġgives": 1442,
      "Ġshows": 1443,
      "Ġdirect": 1444,
      "Ġproj": 1445,
      "Ġpart": 1446,
      "ĠAn": 1447,
      "Ġcalled": 1448,
      "Ġparameter": 1449,
      "onal": 1450,
      "Ġlin": 1451,
      "Ġfield": 1452,
      "ĠÎł": 1453,
      "Ġsche": 1454,
      "elds": 1455,
      "ĠâĭĨ": 1456,
      "Ġcontro": 1457,
      "tern": 1458,
      "oint": 1459,
      "Ġuniform": 1460,
      "Ġfe": 1461,
      "18": 1462,
      "olic": 1463,
      "Ġassociated": 1464,
      "Ġcy": 1465,
      "Ġsem": 1466,
      "},": 1467,
      "cc": 1468,
      "ear": 1469,
      "Ġerror": 1470,
      "Ġdiscus": 1471,
      "red": 1472,
      "ding": 1473,
      "line": 1474,
      "ral": 1475,
      "Ġbased": 1476,
      "Ġinitial": 1477,
      "Ġscal": 1478,
      "dimensional": 1479,
      "ible": 1480,
      "ither": 1481,
      "Ġsmooth": 1482,
      "ck": 1483,
      "art": 1484,
      "tal": 1485,
      "Ġwhile": 1486,
      "ub": 1487,
      "Ġclosed": 1488,
      "Ġhence": 1489,
      "ities": 1490,
      "Ġstandard": 1491,
      "Ġrequire": 1492,
      "Ġrestr": 1493,
      "Ġequal": 1494,
      "Ġhyper": 1495,
      "ĠCorollary": 1496,
      "Ġstates": 1497,
      "Ġway": 1498,
      "Ġinformation": 1499,
      "Ġproduct": 1500,
      "efficient": 1501,
      "Ġleft": 1502,
      "Ġformula": 1503,
      "ĠÎĺ": 1504,
      "Ġrate": 1505,
      "ynam": 1506,
      "Ġallow": 1507,
      "Ġthrough": 1508,
      "Ġargum": 1509,
      "antum": 1510,
      "one": 1511,
      "Ġï£¬": 1512,
      "Ġapproach": 1513,
      "lear": 1514,
      "Ġfam": 1515,
      "Ġnormal": 1516,
      "Ġ11": 1517,
      "Ġextend": 1518,
      "Ġregular": 1519,
      "Ġnatur": 1520,
      "Ġmany": 1521,
      "ulation": 1522,
      "Ġmetric": 1523,
      "Ġconstruction": 1524,
      "mod": 1525,
      "Ġconstruct": 1526,
      "ven": 1527,
      "ics": 1528,
      "Ġconvex": 1529,
      "ides": 1530,
      "Ġï£·": 1531,
      "Ġlower": 1532,
      "Ġconnected": 1533,
      "urn": 1534,
      "Ġaddition": 1535,
      "Ġremain": 1536,
      "Ġser": 1537,
      "Ġcontains": 1538,
      "ighb": 1539,
      "ategor": 1540,
      "Ġeff": 1541,
      "Ġcoefficient": 1542,
      "Ġsurf": 1543,
      "inal": 1544,
      "anti": 1545,
      "otic": 1546,
      "usion": 1547,
      "Ġcomplete": 1548,
      "rop": 1549,
      "ants": 1550,
      "amples": 1551,
      "ments": 1552,
      "ects": 1553,
      "gn": 1554,
      "ane": 1555,
      "Ġide": 1556,
      "Ġsetting": 1557,
      "Ġcompact": 1558,
      "Ġdx": 1559,
      "pper": 1560,
      "Ġequations": 1561,
      "Ġcases": 1562,
      "tition": 1563,
      "ange": 1564,
      "Ġmean": 1565,
      "val": 1566,
      "ÃĹ": 1567,
      "com": 1568,
      "the": 1569,
      "ĠFin": 1570,
      "Ġknown": 1571,
      "mma": 1572,
      "iew": 1573,
      "Ġsolutions": 1574,
      "Ġsufficient": 1575,
      "Ġunit": 1576,
      "vial": 1577,
      "Ġmo": 1578,
      "Ġwhose": 1579,
      "Ġanalysis": 1580,
      "ordin": 1581,
      "rices": 1582,
      "Ġlemma": 1583,
      "vol": 1584,
      "Ġquantum": 1585,
      "Ġcorre": 1586,
      "Ġyi": 1587,
      "Ġestimate": 1588,
      "Ġiter": 1589,
      "ward": 1590,
      "Ġstudy": 1591,
      "Ġprevious": 1592,
      "tiv": 1593,
      "ros": 1594,
      "Ġarbit": 1595,
      "Ġest": 1596,
      "aim": 1597,
      "annel": 1598,
      "Ġ)(": 1599,
      "Ġconf": 1600,
      "Ġlo": 1601,
      "plicit": 1602,
      "ĠConsider": 1603,
      "ympt": 1604,
      "Ġnote": 1605,
      "Ġsingle": 1606,
      "Ġarbitr": 1607,
      "alc": 1608,
      "Ġ||": 1609,
      "verse": 1610,
      "bed": 1611,
      "Ġima": 1612,
      "clude": 1613,
      "gative": 1614,
      "Ġwor": 1615,
      "row": 1616,
      "ĠâĬķ": 1617,
      "Ġdecom": 1618,
      "Ġconvergence": 1619,
      "Ġâī¡": 1620,
      "omorphic": 1621,
      "Ġeither": 1622,
      "Ġnode": 1623,
      "Ġdomain": 1624,
      "Ġneighb": 1625,
      "ymptotic": 1626,
      "ifold": 1627,
      "Ġsen": 1628,
      "Ġpres": 1629,
      "Ġcent": 1630,
      "for": 1631,
      "Ġparameters": 1632,
      "ĠApp": 1633,
      "Ġprec": 1634,
      "Ġfl": 1635,
      "ĠHere": 1636,
      "Ġweight": 1637,
      "ier": 1638,
      "ha": 1639,
      "etry": 1640,
      "Ġmodels": 1641,
      "sp": 1642,
      "Ġrank": 1643,
      "Ġopen": 1644,
      "ĠOn": 1645,
      "Ġlead": 1646,
      "Ġsl": 1647,
      "Ġstrong": 1648,
      "Ġdynam": 1649,
      "Ġgraphs": 1650,
      "Ġgive": 1651,
      "Ġcombin": 1652,
      "cle": 1653,
      "Ġwrite": 1654,
      "Ġupper": 1655,
      "âŁ¨": 1656,
      "ings": 1657,
      "ĠFrom": 1658,
      "Ġrepresentation": 1659,
      "])": 1660,
      "Ġweak": 1661,
      "ner": 1662,
      "The": 1663,
      "Ġconc": 1664,
      "Ġpower": 1665,
      "Ġsystems": 1666,
      "Ġlevel": 1667,
      "iven": 1668,
      "echn": 1669,
      "ĠâĮ": 1670,
      "Ġtree": 1671,
      "lection": 1672,
      "Ġdistance": 1673,
      "Ġchannel": 1674,
      "asing": 1675,
      "ific": 1676,
      "Ġorig": 1677,
      "Ġdiv": 1678,
      "Ġnodes": 1679,
      "Ġsay": 1680,
      "Ġsupport": 1681,
      "Ġexpl": 1682,
      "Î£": 1683,
      "sive": 1684,
      "Ġhere": 1685,
      "Ġener": 1686,
      "ĠRe": 1687,
      "Ġspect": 1688,
      "to": 1689,
      "ecess": 1690,
      "Ġfactor": 1691,
      "Ġbelow": 1692,
      "Ġdiscre": 1693,
      "Ġadd": 1694,
      "Ġcoordin": 1695,
      "Ġsym": 1696,
      "ĠFurther": 1697,
      "Ġlast": 1698,
      "Ġinters": 1699,
      "Ġgenerated": 1700,
      "abel": 1701,
      "Ġvariable": 1702,
      "ually": 1703,
      "Ġquanti": 1704,
      "ording": 1705,
      "Ġcalc": 1706,
      ")/": 1707,
      "ertain": 1708,
      "Ġasymptotic": 1709,
      "Ġgl": 1710,
      "]).": 1711,
      "sity": 1712,
      "ĠCom": 1713,
      "Ġgo": 1714,
      "Ġmethods": 1715,
      "Ġâ©½": 1716,
      "ately": 1717,
      "Îº": 1718,
      "Ġhow": 1719,
      "iod": 1720,
      "ton": 1721,
      "chie": 1722,
      "Ġbasis": 1723,
      "Ġbloc": 1724,
      "Ġroot": 1725,
      "ĠGiven": 1726,
      "Ġmeans": 1727,
      "Ġnatural": 1728,
      "Ġmatrices": 1729,
      "Ġmaps": 1730,
      "ĠFinally": 1731,
      "Ġproposed": 1732,
      "Ġidentif": 1733,
      "ĠâĬ¤": 1734,
      "Ġabout": 1735,
      "Ġtrue": 1736,
      "ĠÂ´": 1737,
      "ĠNe": 1738,
      "Ġhigh": 1739,
      "hood": 1740,
      "Ġachie": 1741,
      "ĠUsing": 1742,
      "Ġeigenvalu": 1743,
      "ind": 1744,
      "Ġenergy": 1745,
      "ug": 1746,
      "Ġcos": 1747,
      "Ġtherefore": 1748,
      "ently": 1749,
      "Ġcost": 1750,
      "Ġproblems": 1751,
      "Ġgeom": 1752,
      "Ġthem": 1753,
      "Ġpartition": 1754,
      "ĠË": 1755,
      "jective": 1756,
      "ified": 1757,
      "Ġla": 1758,
      "ĠRec": 1759,
      "Ġbounds": 1760,
      "Ġcomponent": 1761,
      "Ġcurve": 1762,
      "Ġtechn": 1763,
      "lect": 1764,
      "Ġ)|": 1765,
      "ĠOur": 1766,
      "Ġindex": 1767,
      "Ġchoice": 1768,
      "Ġwithout": 1769,
      "Î¶": 1770,
      "Ġrelation": 1771,
      "Ġvery": 1772,
      "Ġspaces": 1773,
      "Ġexpon": 1774,
      "Ġgrad": 1775,
      "Ġche": 1776,
      "Ġnext": 1777,
      "22": 1778,
      "Ġnecess": 1779,
      "Ġ'": 1780,
      "ased": 1781,
      "ÎĽ": 1782,
      "Ġobserv": 1783,
      "Ġcontrol": 1784,
      "Ġprim": 1785,
      "Ġcategor": 1786,
      "Ġapproximation": 1787,
      "Ġinfinite": 1788,
      "Ġfamily": 1789,
      "sian": 1790,
      "Ġsin": 1791,
      "Ġalong": 1792,
      "Ġtake": 1793,
      "ene": 1794,
      "ĠâĪħ": 1795,
      "Ġdenotes": 1796,
      "Ġside": 1797,
      "ave": 1798,
      "group": 1799,
      "ĠSo": 1800,
      "Ġregion": 1801,
      "Ġtotal": 1802,
      "Ġsymmetric": 1803,
      "mit": 1804,
      "Ġfurther": 1805,
      ")]": 1806,
      "Ġstrate": 1807,
      "Ġâĩ": 1808,
      "ute": 1809,
      "log": 1810,
      "oss": 1811,
      "Ġtre": 1812,
      "ify": 1813,
      "ĠâĪĴâĨĴ": 1814,
      "Ġdetail": 1815,
      "joint": 1816,
      "iter": 1817,
      "ĠCh": 1818,
      "Ġnotation": 1819,
      "Ġcir": 1820,
      "Ġcompute": 1821,
      "more": 1822,
      "ĠSim": 1823,
      "Ġbel": 1824,
      "Ġcomponents": 1825,
      "Ġembed": 1826,
      "Ġindic": 1827,
      "Ġdue": 1828,
      "most": 1829,
      "ences": 1830,
      "Ġinvariant": 1831,
      "Ġgu": 1832,
      "pping": 1833,
      "Ġstat": 1834,
      "Ġsatisfying": 1835,
      "ĠII": 1836,
      "ĠSp": 1837,
      "ĠFirst": 1838,
      "Î¦": 1839,
      "man": 1840,
      "Ġextension": 1841,
      "Ġalgorithms": 1842,
      "Ġimport": 1843,
      "led": 1844,
      "ision": 1845,
      "ules": 1846,
      "Ġthose": 1847,
      "Ġscheme": 1848,
      "Ġapply": 1849,
      "Ġnumer": 1850,
      "erence": 1851,
      "Ġread": 1852,
      "Ġafter": 1853,
      "ets": 1854,
      "Ġtransform": 1855,
      "Ġpri": 1856,
      "Ġarbitrary": 1857,
      "21": 1858,
      "Ġinteger": 1859,
      "ency": 1860,
      "arch": 1861,
      "Ġargument": 1862,
      "ĠWhen": 1863,
      "Ġfree": 1864,
      "ĠInd": 1865,
      "Ġtriang": 1866,
      "Ġrepl": 1867,
      "ead": 1868,
      "ĠĠ": 1869,
      "Ġexpression": 1870,
      "verage": 1871,
      "ĠâĢł": 1872,
      "Ġdt": 1873,
      "ĠâĬ¥": 1874,
      "Ġshould": 1875,
      "Ġgroups": 1876,
      "Ġocc": 1877,
      "Ġsepar": 1878,
      "Ġbeha": 1879,
      "Ġappear": 1880,
      "Ġdensity": 1881,
      "up": 1882,
      "mon": 1883,
      "Ġdiagram": 1884,
      "ernel": 1885,
      "edi": 1886,
      "Ġclassical": 1887,
      "Ġinput": 1888,
      "Ġoperators": 1889,
      "Ġbeing": 1890,
      "plit": 1891,
      "Ġlear": 1892,
      "Ġexplicit": 1893,
      "Ġconsid": 1894,
      "Ġspecial": 1895,
      "ax": 1896,
      "Ġï£¯": 1897,
      "Ġclaim": 1898,
      "Ġtran": 1899,
      "ys": 1900,
      "Ġsurface": 1901,
      "abl": 1902,
      "Ġproved": 1903,
      "Ġbi": 1904,
      "Ġcap": 1905,
      "Ġ13": 1906,
      "ĠAlgorithm": 1907,
      "Ġcannot": 1908,
      "Ġbr": 1909,
      "Ġke": 1910,
      "Ġagain": 1911,
      "Ġloss": 1912,
      "inary": 1913,
      "Ġsqu": 1914,
      "Ġconsidered": 1915,
      "Ġisomorphism": 1916,
      "ided": 1917,
      "Ġï£º": 1918,
      "Ġclear": 1919,
      "Ġmaximum": 1920,
      "ĠAssume": 1921,
      "Ġdecomposition": 1922,
      "mis": 1923,
      "Ġdescribed": 1924,
      "Ġvia": 1925,
      "ĠEq": 1926,
      "Ġlabel": 1927,
      "Ġ((": 1928,
      "23": 1929,
      "orphism": 1930,
      "âĨĴâĪŀ": 1931,
      "Ġ19": 1932,
      "ries": 1933,
      "Ġyields": 1934,
      ")âĪ¥": 1935,
      ")).": 1936,
      "ways": 1937,
      "25": 1938,
      "Ġperformance": 1939,
      "Ġprecise": 1940,
      "Ġcoefficients": 1941,
      "Ġinvol": 1942,
      "perim": 1943,
      "Ġinstance": 1944,
      "ĠThese": 1945,
      "Ġwere": 1946,
      "ĠGaus": 1947,
      "cept": 1948,
      "clusion": 1949,
      "24": 1950,
      "Ġchoose": 1951,
      "Ġenough": 1952,
      "Ġexactly": 1953,
      "Ġhold": 1954,
      "oid": 1955,
      "astic": 1956,
      "Ġperiod": 1957,
      "Ġversion": 1958,
      "Ġflow": 1959,
      "af": 1960,
      "âī¥": 1961,
      "Ġsense": 1962,
      "Ġdi": 1963,
      "Ġdirection": 1964,
      "Ġlike": 1965,
      "Ġpred": 1966,
      "Ġalways": 1967,
      "Ġir": 1968,
      "Ġrun": 1969,
      "Ġrelative": 1970,
      "uting": 1971,
      "Ġdiag": 1972,
      "Ġav": 1973,
      "Ġinterval": 1974,
      "velop": 1975,
      "Ġintegral": 1976,
      "Ġkernel": 1977,
      "eg": 1978,
      "Ġprojection": 1979,
      "ole": 1980,
      "och": 1981,
      "uch": 1982,
      "Ġframe": 1983,
      "ĠâĪ¨": 1984,
      "Ġstar": 1985,
      "ons": 1986,
      "Ġcalcul": 1987,
      "ĠOne": 1988,
      "Ġ..": 1989,
      "less": 1990,
      "Ġdenoted": 1991,
      "Ġcheck": 1992,
      "rict": 1993,
      "Ġestabl": 1994,
      "ĠðĿ": 1995,
      "ior": 1996,
      "acy": 1997,
      "ators": 1998,
      "Ġvectors": 1999,
      "til": 2000,
      "umn": 2001,
      "ult": 2002,
      "Ġ16": 2003,
      "linear": 2004,
      "read": 2005,
      "ok": 2006,
      "Ġinterp": 2007,
      "Ġcr": 2008,
      "Ġview": 2009,
      "Ġrelations": 2010,
      "Ġhyp": 2011,
      "Ġmake": 2012,
      "Ġconclude": 2013,
      "Ġexistence": 2014,
      "endix": 2015,
      "uc": 2016,
      "sc": 2017,
      "Ġcertain": 2018,
      "ĠWith": 2019,
      "Ġln": 2020,
      "Ġ#": 2021,
      "emp": 2022,
      "ĠRecall": 2023,
      "Ġstrict": 2024,
      "Ġsubgroup": 2025,
      "Ġimportant": 2026,
      "Ġperm": 2027,
      "Ġtra": 2028,
      "We": 2029,
      "Ġsuper": 2030,
      "Ġbund": 2031,
      "ĠExample": 2032,
      "ared": 2033,
      "estion": 2034,
      "Ġtimes": 2035,
      "izing": 2036,
      "Ġrow": 2037,
      "Ġhig": 2038,
      "ĠFurthermore": 2039,
      "Ġminimal": 2040,
      "Ġprovide": 2041,
      "Ġimm": 2042,
      "ret": 2043,
      "Ġbehavi": 2044,
      "Ġevalu": 2045,
      "osen": 2046,
      "Ġdim": 2047,
      "till": 2048,
      "ĠSt": 2049,
      "Ġcomplexity": 2050,
      "Ġquad": 2051,
      "Ġcomputation": 2052,
      "Ġorth": 2053,
      "Ġ([": 2054,
      "Ġcolumn": 2055,
      "Ġdiscrete": 2056,
      "Ġintroduce": 2057,
      "âĮ": 2058,
      "Ġoccur": 2059,
      "ante": 2060,
      "sequence": 2061,
      "Ġglob": 2062,
      "ental": 2063,
      "Ġrelated": 2064,
      "ensor": 2065,
      "ological": 2066,
      "itten": 2067,
      "Ġtor": 2068,
      "Ġdifferential": 2069,
      "Ġfound": 2070,
      "Ġimage": 2071,
      "Ġmaximal": 2072,
      "Ġ`": 2073,
      "Ġrefer": 2074,
      "Ġpot": 2075,
      "olution": 2076,
      "Ġ...,": 2077,
      "Ġatt": 2078,
      "pr": 2079,
      "Ġproced": 2080,
      "graph": 2081,
      "sif": 2082,
      "sign": 2083,
      "Ġchange": 2084,
      "Ġmanifold": 2085,
      "Ġlong": 2086,
      "ĠSimilar": 2087,
      "ility": 2088,
      "Ġï£«": 2089,
      "Ġï£Ń": 2090,
      "Ġcontrad": 2091,
      "otop": 2092,
      "Ġï£¸": 2093,
      "Ġï£¶": 2094,
      "ĠTable": 2095,
      "uted": 2096,
      "(âĪĴ": 2097,
      "Ġrad": 2098,
      "rest": 2099,
      "ĠâĻ": 2100,
      "Ġ14": 2101,
      "Ġchain": 2102,
      "Ġdual": 2103,
      "Ġsingular": 2104,
      "itive": 2105,
      "ON": 2106,
      "Ġmorphism": 2107,
      "Ġclasses": 2108,
      "ict": 2109,
      "Ġcould": 2110,
      "Ġaccording": 2111,
      "Ġ[?": 2112,
      "Ġblock": 2113,
      "Ġinduced": 2114,
      "Ġidentity": 2115,
      "Ġchosen": 2116,
      "ching": 2117,
      "Ġdevelop": 2118,
      "ĠTr": 2119,
      "Ġval": 2120,
      "arily": 2121,
      "Ġmultiplic": 2122,
      "ĠGaussian": 2123,
      "tri": 2124,
      "Ġneighbor": 2125,
      "son": 2126,
      "hom": 2127,
      "ired": 2128,
      "Ġnumbers": 2129,
      "rient": 2130,
      "Ġimpro": 2131,
      "ply": 2132,
      "Ġclust": 2133,
      "pos": 2134,
      "other": 2135,
      "ĠâĨĲ": 2136,
      "Ġdesign": 2137,
      "Ġnotion": 2138,
      "Ġanalog": 2139,
      "Ġemp": 2140,
      "ĠIndeed": 2141,
      "av": 2142,
      "duc": 2143,
      "igur": 2144,
      "tit": 2145,
      "Ġcell": 2146,
      "Ġestimates": 2147,
      "Ġbelong": 2148,
      "Ġreas": 2149,
      "Ġexperim": 2150,
      "ron": 2151,
      "Ġuniformly": 2152,
      "odes": 2153,
      "Ġback": 2154,
      "Ġinterest": 2155,
      "Ġcode": 2156,
      "Ïĩ": 2157,
      "Ġclose": 2158,
      "Ġguar": 2159,
      "Ġorient": 2160,
      "Ġalmost": 2161,
      ");": 2162,
      "ications": 2163,
      "izes": 2164,
      "Ġstill": 2165,
      "Ġstable": 2166,
      "Ġtrivial": 2167,
      "Ġaverage": 2168,
      "Ġjust": 2169,
      "Ġfull": 2170,
      "Ġcorresponds": 2171,
      "time": 2172,
      "Ġfour": 2173,
      "entially": 2174,
      "Ġgre": 2175,
      "side": 2176,
      "Ġeasy": 2177,
      "Ġprinc": 2178,
      "Ġequivalence": 2179,
      "ource": 2180,
      "Ġprogram": 2181,
      "Ġintroduced": 2182,
      "Ġcover": 2183,
      "Ġtest": 2184,
      "Ġquestion": 2185,
      "Ġsimpl": 2186,
      "Ġhypot": 2187,
      "Ġcurves": 2188,
      "assif": 2189,
      "Ġrecall": 2190,
      "Ġinclud": 2191,
      "Ġbefore": 2192,
      "ade": 2193,
      "dd": 2194,
      "Ġill": 2195,
      "Ġstatement": 2196,
      "Ġplay": 2197,
      "gether": 2198,
      "ivers": 2199,
      "Ġtogether": 2200,
      "Ġguarante": 2201,
      "26": 2202,
      "Ġrece": 2203,
      "sel": 2204,
      "Ġturn": 2205,
      "ustr": 2206,
      "Ġminimum": 2207,
      "):": 2208,
      "âĬ": 2209,
      "Ġstrategy": 2210,
      "Ġexamples": 2211,
      "Ġcategory": 2212,
      "Ġposition": 2213,
      "Ġimple": 2214,
      "rent": 2215,
      "Ġconstraints": 2216,
      "ritical": 2217,
      "Ġotherwise": 2218,
      "Ġirre": 2219,
      "Ġcoun": 2220,
      "Ġsubsp": 2221,
      "know": 2222,
      "Ġmom": 2223,
      "Ġoptimization": 2224,
      "sib": 2225,
      "zero": 2226,
      "Ġcros": 2227,
      "tically": 2228,
      "ick": 2229,
      "Ġnumerical": 2230,
      "Ġsample": 2231,
      "ĠCl": 2232,
      "Ġvan": 2233,
      "ĠNo": 2234,
      "Ġ(âĢ¢": 2235,
      "ount": 2236,
      "Ġconfigur": 2237,
      "Ġsufficiently": 2238,
      "lation": 2239,
      "ee": 2240,
      "Ġphase": 2241,
      "ĠPo": 2242,
      "text": 2243,
      "ances": 2244,
      "Ġ],": 2245,
      "Ġtransition": 2246,
      "Ġenc": 2247,
      "Ġseries": 2248,
      "Ġvol": 2249,
      "Ġsever": 2250,
      "vant": 2251,
      "Ġcommun": 2252,
      "Ġeasily": 2253,
      "Ġprocedure": 2254,
      ")),": 2255,
      "Ġ15": 2256,
      "Ġcontained": 2257,
      "bol": 2258,
      "Ġseveral": 2259,
      "Ġless": 2260,
      "Ġ},": 2261,
      "Ġwords": 2262,
      "jecture": 2263,
      "Ġintersection": 2264,
      "Ġquas": 2265,
      "ĠOb": 2266,
      "Ġmak": 2267,
      "Ġsuppose": 2268,
      "Ġconven": 2269,
      "ogene": 2270,
      "ĠHam": 2271,
      "27": 2272,
      "Ġexpected": 2273,
      "Ġassumptions": 2274,
      "Ġbu": 2275,
      "Ġact": 2276,
      "Ġwhether": 2277,
      "Ġconstraint": 2278,
      "Ġadj": 2279,
      "Ġdepends": 2280,
      "TI": 2281,
      "hesis": 2282,
      "ĠPr": 2283,
      "ochastic": 2284,
      "Ġfre": 2285,
      "amely": 2286,
      "28": 2287,
      "unctor": 2288,
      "ĠAppendix": 2289,
      "Ġlow": 2290,
      "work": 2291,
      "Ġglobal": 2292,
      "ius": 2293,
      "Ġrestriction": 2294,
      "Ġcycl": 2295,
      "rid": 2296,
      "Ġassign": 2297,
      "gin": 2298,
      "Ġdifference": 2299,
      "Ġoriginal": 2300,
      "olds": 2301,
      "Ġanother": 2302,
      "Ġapplied": 2303,
      "Ġnoise": 2304,
      "Ġwhat": 2305,
      "Ġcommon": 2306,
      "Ġ{(": 2307,
      "tics": 2308,
      "Ġrule": 2309,
      "wh": 2310,
      "Ġfil": 2311,
      "tivity": 2312,
      "Ġallows": 2313,
      "Ġsimply": 2314,
      "ik": 2315,
      "ink": 2316,
      "Ġbo": 2317,
      "Ġess": 2318,
      "Ġpreser": 2319,
      "Ġdecre": 2320,
      "Ġwithin": 2321,
      "Ġnegative": 2322,
      "tur": 2323,
      "Ġhigher": 2324,
      "Ġobserve": 2325,
      "Ġorbit": 2326,
      "Ġ}.": 2327,
      "Ġcompar": 2328,
      "Ġrequired": 2329,
      "ention": 2330,
      "bolic": 2331,
      "Ġsit": 2332,
      "Ġord": 2333,
      "order": 2334,
      "Ġillustr": 2335,
      "Ġclassif": 2336,
      "Ġáº": 2337,
      "elf": 2338,
      "Ġpairs": 2339,
      "Ġlattice": 2340,
      "Ġupd": 2341,
      "ras": 2342,
      "ages": 2343,
      "Ġlocally": 2344,
      "Ġcanon": 2345,
      "Ġel": 2346,
      "ilton": 2347,
      "Ġds": 2348,
      "ĠâĪŀ.": 2349,
      "Ġgeometric": 2350,
      "Ġsampl": 2351,
      "Ġimplement": 2352,
      "Ġstochastic": 2353,
      "Ġsatisfied": 2354,
      "Ġdistin": 2355,
      "Ġlearning": 2356,
      "Ġcontext": 2357,
      "Ġsumm": 2358,
      "ĠâĪŀ,": 2359,
      "Ġabs": 2360,
      "ĠEqu": 2361,
      "Ġimmedi": 2362,
      "30": 2363,
      "ansion": 2364,
      "Ġconj": 2365,
      "ĠGr": 2366,
      "Ġexpect": 2367,
      "known": 2368,
      "ĠInt": 2369,
      "Ġpresented": 2370,
      "Ġgradient": 2371,
      ")}": 2372,
      "Ġshall": 2373,
      "Ġoutput": 2374,
      "Ġreplac": 2375,
      "Ġauth": 2376,
      "Ġdistributions": 2377,
      "Ġproposition": 2378,
      "Ġlink": 2379,
      "ĠLie": 2380,
      "Ġcomputed": 2381,
      "Ġbecom": 2382,
      "Ġstatis": 2383,
      "ilib": 2384,
      "Ġtaking": 2385,
      "Ġtensor": 2386,
      "Ġodd": 2387,
      "Ġconverges": 2388,
      "Ġdetermined": 2389,
      "ĠSimilarly": 2390,
      "Ġbundle": 2391,
      "icted": 2392,
      "Ġvalid": 2393,
      "Ġconsists": 2394,
      "Ġconnection": 2395,
      "ĠÎ¹": 2396,
      "Ġreason": 2397,
      "Ġalgebraic": 2398,
      "Ġembedding": 2399,
      "ĠSte": 2400,
      "Ġdu": 2401,
      "Ġcoordinates": 2402,
      "Ġpolynomials": 2403,
      "Ġeigenvalues": 2404,
      "Ġframework": 2405,
      "Ġnecessary": 2406,
      "DE": 2407,
      "off": 2408,
      "variance": 2409,
      "Ġsplit": 2410,
      "Ġpermut": 2411,
      "Ġdynamics": 2412,
      "tig": 2413,
      "Ġmultiple": 2414,
      "Ġsymbol": 2415,
      "ips": 2416,
      "ĠLe": 2417,
      "pro": 2418,
      "ilibri": 2419,
      "Ġadditional": 2420,
      "aves": 2421,
      "cing": 2422,
      "...,": 2423,
      "ready": 2424,
      "Ġprop": 2425,
      "Ġsimplic": 2426,
      "||": 2427,
      "29": 2428,
      "Ġinstead": 2429,
      "ater": 2430,
      "Ġbecomes": 2431,
      "/(": 2432,
      "Ġmuch": 2433,
      "Ġprecisely": 2434,
      "Ġpartial": 2435,
      "Ġgood": 2436,
      "Ġprovided": 2437,
      "Ġfunctor": 2438,
      "Ġshort": 2439,
      "uring": 2440,
      "Ġsteps": 2441,
      "Ġequality": 2442,
      "Ġ?": 2443,
      "ceed": 2444,
      "Ġdiagonal": 2445,
      "Ġalready": 2446,
      "Ġwritten": 2447,
      "gebras": 2448,
      "Ġincreasing": 2449,
      "ĠNext": 2450,
      "itz": 2451,
      "Ġexpansion": 2452,
      "Ġmodul": 2453,
      "lo": 2454,
      "Ġdirectly": 2455,
      "Ġevent": 2456,
      "Ġax": 2457,
      "Ġcontrib": 2458,
      "Ġ200": 2459,
      "Ġcommut": 2460,
      "ocus": 2461,
      "Ġorthog": 2462,
      "Ġseen": 2463,
      "Ġmark": 2464,
      "Ġnetworks": 2465,
      "Ġspectral": 2466,
      "ĠLa": 2467,
