{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "Ġt": 261,
      "Ġa": 262,
      "he": 263,
      "Ġâ": 264,
      "Ġi": 265,
      "on": 266,
      "Ġthe": 267,
      "ti": 268,
      "re": 269,
      "Ġs": 270,
      "Ġ(": 271,
      "Ġo": 272,
      "Ġc": 273,
      "in": 274,
      "er": 275,
      "ĠâĪ": 276,
      "Ġf": 277,
      "or": 278,
      "Ġw": 279,
      "en": 280,
      "Ġp": 281,
      "Ġof": 282,
      "nd": 283,
      "at": 284,
      "Ġ1": 285,
      "tion": 286,
      "al": 287,
      "Ġd": 288,
      "Ġb": 289,
      "es": 290,
      "ĠÎ": 291,
      "Ġ2": 292,
      "Ġn": 293,
      "Ġin": 294,
      "ed": 295,
      "Ġm": 296,
      "ro": 297,
      "Ġ=": 298,
      "Ġand": 299,
      "it": 300,
      "Ġis": 301,
      "Ġth": 302,
      "ar": 303,
      "Ġe": 304,
      "ĠT": 305,
      "an": 306,
      "Ġ)": 307,
      "le": 308,
      "is": 309,
      "Ġ,": 310,
      "ĠâĪĴ": 311,
      "Ġ.": 312,
      "Ġto": 313,
      "ing": 314,
      "ic": 315,
      "Ġ0": 316,
      "ĠÏ": 317,
      "et": 318,
      "Ġthat": 319,
      "om": 320,
      "Ġfor": 321,
      "ĠâĢ": 322,
      "ve": 323,
      "Ġre": 324,
      "as": 325,
      "ly": 326,
      "Ġh": 327,
      "Ġg": 328,
      "Ġ+": 329,
      "Ġl": 330,
      "Ġu": 331,
      "ation": 332,
      "ec": 333,
      "Ġcon": 334,
      "Ġwe": 335,
      "ll": 336,
      "âĪ": 337,
      "ac": 338,
      "ent": 339,
      "Ġk": 340,
      "ĠA": 341,
      "ĠS": 342,
      "ĠThe": 343,
      "ĠL": 344,
      "st": 345,
      "ow": 346,
      "si": 347,
      "Ġv": 348,
      "ĠI": 349,
      "Ġon": 350,
      "ĠF": 351,
      "ith": 352,
      "Ġpro": 353,
      "im": 354,
      "Ġq": 355,
      "ĠC": 356,
      "ce": 357,
      "ot": 358,
      "ĠP": 359,
      "ou": 360,
      "Ġbe": 361,
      "Ġsu": 362,
      "Ġ[": 363,
      "Ġr": 364,
      "ĠâĪĪ": 365,
      "Ġâī": 366,
      "Ġas": 367,
      "Ġx": 368,
      "se": 369,
      "ul": 370,
      "Ġwith": 371,
      "Ġan": 372,
      "ĠR": 373,
      "ol": 374,
      "Ġby": 375,
      "Ġj": 376,
      "ĠW": 377,
      "Ġ3": 378,
      "ĠN": 379,
      "ĠâĢ²": 380,
      "Ġst": 381,
      "Ġex": 382,
      "qu": 383,
      "ĠB": 384,
      "am": 385,
      "ver": 386,
      "ĠH": 387,
      "Ġ|": 388,
      "ĠM": 389,
      "ig": 390,
      "ĠâĢ¢": 391,
      "ore": 392,
      "ts": 393,
      "od": 394,
      "um": 395,
      "âĪĴ": 396,
      "ri": 397,
      "Ġare": 398,
      "ur": 399,
      "Ġde": 400,
      "ĠE": 401,
      "ut": 402,
      "ĠG": 403,
      "ab": 404,
      "em": 405,
      "ĠD": 406,
      "Ġcom": 407,
      "ch": 408,
      "ain": 409,
      ").": 410,
      "res": 411,
      "pp": 412,
      "ity": 413,
      "),": 414,
      "Ġal": 415,
      "ĠX": 416,
      "ction": 417,
      "tic": 418,
      "il": 419,
      "ate": 420,
      "Ġâī¤": 421,
      "tin": 422,
      "Ġwh": 423,
      "Ġwhe": 424,
      "ap": 425,
      "Ġ*": 426,
      "fin": 427,
      "iv": 428,
      "Ġpo": 429,
      "Ġ4": 430,
      "Ġthis": 431,
      "ct": 432,
      "el": 433,
      "ter": 434,
      "Ġcan": 435,
      "Ġ:": 436,
      "Ġcomp": 437,
      "ĠWe": 438,
      "if": 439,
      "ir": 440,
      "ure": 441,
      "Ġha": 442,
      "ge": 443,
      "un": 444,
      "ĠÎ±": 445,
      "ĨĴ": 446,
      "Ġy": 447,
      "tive": 448,
      "rom": 449,
      "oll": 450,
      "ĠâĬ": 451,
      "Ġï": 452,
      "pl": 453,
      "Ġï£": 454,
      "ĠK": 455,
      "ich": 456,
      "ĠIn": 457,
      "Ġor": 458,
      "ting": 459,
      "Ġle": 460,
      "her": 461,
      "te": 462,
      "id": 463,
      "Ġall": 464,
      "ĠÂ": 465,
      "Ġwhich": 466,
      "Ġfrom": 467,
      "iz": 468,
      "ĠV": 469,
      "per": 470,
      "Ġres": 471,
      "Ġhave": 472,
      "us": 473,
      "Ġif": 474,
      "Ġsp": 475,
      "ĠO": 476,
      "Ġ{": 477,
      "og": 478,
      "ollow": 479,
      "ĠâĨĴ": 480,
      "ad": 481,
      "Ġwhere": 482,
      "ition": 483,
      "orm": 484,
      "Ġnot": 485,
      "Ġfollow": 486,
      "Ġit": 487,
      "Ġz": 488,
      "ay": 489,
      "Ġat": 490,
      "Ġdis": 491,
      "ĠâĦ": 492,
      "Ġset": 493,
      "Ġpar": 494,
      "ĠÎ»": 495,
      "ĠâĪ¥": 496,
      "ma": 497,
      "Ġse": 498,
      "Ġsh": 499,
      "sion": 500,
      "ble": 501,
      "Ġus": 502,
      "der": 503,
      "ence": 504,
      "ari": 505,
      "ĠTh": 506,
      "orem": 507,
      "ect": 508,
      "ĠU": 509,
      "Ġdefin": 510,
      "of": 511,
      "ally": 512,
      "po": 513,
      "end": 514,
      "unction": 515,
      "ess": 516,
      "Ġsuch": 517,
      "oc": 518,
      "ant": 519,
      "ach": 520,
      "ations": 521,
      "Ġun": 522,
      "Ġtr": 523,
      "Ġch": 524,
      "ener": 525,
      "ection": 526,
      "tain": 527,
      "Ġcl": 528,
      "Ġfunction": 529,
      "ĠLet": 530,
      "Ġequ": 531,
      "ound": 532,
      "Ġob": 533,
      "Ġapp": 534,
      "all": 535,
      "ase": 536,
      "Ġthen": 537,
      "ple": 538,
      "ĠPro": 539,
      "Ġco": 540,
      "ution": 541,
      "ere": 542,
      "ary": 543,
      "able": 544,
      "ment": 545,
      "str": 546,
      "ies": 547,
      "ĠÃ": 548,
      "ated": 549,
      "Ġâī¥": 550,
      "du": 551,
      "act": 552,
      "ĠQ": 553,
      "ĠÏĥ": 554,
      "igh": 555,
      "Ġthere": 556,
      "ĠÂµ": 557,
      "Ġ>": 558,
      "rou": 559,
      "Ġ5": 560,
      "Ġne": 561,
      "and": 562,
      "ĠZ": 563,
      "Ġ<": 564,
      "Ġsub": 565,
      "ĠÎ²": 566,
      "tim": 567,
      "ĠÎ³": 568,
      "ĠFor": 569,
      "Ġone": 570,
      "ite": 571,
      "ace": 572,
      "Ġbound": 573,
      "Ġmod": 574,
      "erm": 575,
      "Ġma": 576,
      "ĠTheorem": 577,
      "ine": 578,
      "ĠÎ´": 579,
      "ati": 580,
      "ĠâĪŀ": 581,
      "ther": 582,
      "Ġgener": 583,
      "Ġsy": 584,
      "Ġqu": 585,
      "ond": 586,
      "Ġim": 587,
      "ĠY": 588,
      "Ġany": 589,
      "Ġtw": 590,
      "Ġhas": 591,
      "ill": 592,
      "sition": 593,
      "Ġform": 594,
      "ber": 595,
      "Ġass": 596,
      "Ġind": 597,
      "Ġgiv": 598,
      "Ġshow": 599,
      "alu": 600,
      "Ġresul": 601,
      "Ġver": 602,
      "ric": 603,
      "))": 604,
      "ĠÎµ": 605,
      "ĠÏģ": 606,
      "Ġeach": 607,
      "ome": 608,
      "ĠâĪĤ": 609,
      "Ġtwo": 610,
      "Ġpoin": 611,
      "ous": 612,
      "ĠÎ¸": 613,
      "].": 614,
      "ĠThis": 615,
      "ff": 616,
      "so": 617,
      "emma": 618,
      "ĠÏĦ": 619,
      "ince": 620,
      "form": 621,
      "os": 622,
      "th": 623,
      "Ġsim": 624,
      "Ġfin": 625,
      "ds": 626,
      "ĠÏĢ": 627,
      "ose": 628,
      "ĠLemma": 629,
      "ular": 630,
      "gor": 631,
      "ĠâĦĵ": 632,
      "Ġcase": 633,
      "ial": 634,
      "Ġnum": 635,
      "Ġad": 636,
      "rib": 637,
      "Ġden": 638,
      "ĠÃĹ": 639,
      "Î±": 640,
      "dition": 641,
      "Ġab": 642,
      "],": 643,
      "Ġexp": 644,
      "Ġwill": 645,
      "ree": 646,
      "Ġar": 647,
      "iff": 648,
      "ame": 649,
      "Ġfollowing": 650,
      "Ġstr": 651,
      "Ġgr": 652,
      "Ġmat": 653,
      "Ġsol": 654,
      "Ġme": 655,
      "Ġnon": 656,
      "Ġ6": 657,
      "âĪ¥": 658,
      "ans": 659,
      "irst": 660,
      "ĠJ": 661,
      "ote": 662,
      "eren": 663,
      "ical": 664,
      "Ł©": 665,
      "ĠThen": 666,
      "ud": 667,
      "Ġ),": 668,
      "Ġonly": 669,
      "gr": 670,
      "Ġsome": 671,
      "aph": 672,
      "Ġalso": 673,
      "ator": 674,
      "Ġcor": 675,
      "âĪĪ": 676,
      "Ġdiff": 677,
      "Ġfi": 678,
      "ep": 679,
      "ithm": 680,
      "position": 681,
      "Ġint": 682,
      "Ġgiven": 683,
      "ates": 684,
      "cl": 685,
      "ak": 686,
      "Ġtim": 687,
      "âĢ": 688,
      "ight": 689,
      "Ġ]": 690,
      "Ġ}": 691,
      "abil": 692,
      "etw": 693,
      "blem": 694,
      "ers": 695,
      "Ġnumber": 696,
      "ass": 697,
      "Ġinter": 698,
      "ance": 699,
      "Ġexis": 700,
      "ĠÎĵ": 701,
      "ĠFig": 702,
      "ĠÏķ": 703,
      "Ġ).": 704,
      "ire": 705,
      "Ġdist": 706,
      "ph": 707,
      "Ġes": 708,
      "resent": 709,
      "atis": 710,
      "Ġpre": 711,
      "enti": 712,
      "Ġvari": 713,
      "sider": 714,
      "âĦ": 715,
      "Ġ-": 716,
      "Ġmin": 717,
      "ork": 718,
      "gorithm": 719,
      "Ġlog": 720,
      "ĠÏī": 721,
      "ra": 722,
      "Ġproblem": 723,
      "ĠÏµ": 724,
      "Ġfollows": 725,
      "Ġassum": 726,
      "ension": 727,
      "xim": 728,
      "Ġobtain": 729,
      "Ġ:=": 730,
      "Ġcomple": 731,
      "Ġmodel": 732,
      "Ġfirst": 733,
      "ĠâĪĨ": 734,
      "ative": 735,
      "ĠIf": 736,
      "Ġop": 737,
      "Ġ/": 738,
      "Ġcondition": 739,
      "Ġso": 740,
      "ard": 741,
      "roup": 742,
      "Î»": 743,
      "ges": 744,
      "ĠÎ·": 745,
      "Ġrel": 746,
      "ĠÏĨ": 747,
      "Ġour": 748,
      "ient": 749,
      "Ł¨": 750,
      "Ġno": 751,
      "ong": 752,
      "ctor": 753,
      "op": 754,
      "Ġmet": 755,
      "Ġvalu": 756,
      "ves": 757,
      "Ġinte": 758,
      "Ġtime": 759,
      "Ġconstr": 760,
      "resp": 761,
      "ty": 762,
      "stem": 763,
      "atisf": 764,
      "uct": 765,
      "orph": 766,
      "Ġover": 767,
      "ability": 768,
      ".,": 769,
      "ĠProof": 770,
      "Ġsatisf": 771,
      "Ġproof": 772,
      "ĠAs": 773,
      "ality": 774,
      "Ġother": 775,
      "Ġcont": 776,
      "oth": 777,
      "Ġdes": 778,
      "ise": 779,
      "ties": 780,
      "Ġappro": 781,
      "Ġhe": 782,
      "Ġgraph": 783,
      "Ġwhen": 784,
      "Ġper": 785,
      "Ġrep": 786,
      "ĠÎ¾": 787,
      "Ġsc": 788,
      "ĠâĦ¦": 789,
      "Ġdifferen": 790,
      "very": 791,
      "Ġac": 792,
      "Ġsm": 793,
      "Ġsystem": 794,
      "ffic": 795,
      "ĠÏĪ": 796,
      "ective": 797,
      "Ġlet": 798,
      "Ġid": 799,
      "Ġsolution": 800,
      "ðĿ": 801,
      "Ġspace": 802,
      "Ġits": 803,
      "ust": 804,
      "Ġterm": 805,
      "ang": 806,
      "ĠÎ½": 807,
      "yp": 808,
      "Ġresp": 809,
      "Ġalgorithm": 810,
      "Ġdet": 811,
      "Ġline": 812,
      "ĠâĬĹ": 813,
      "ie": 814,
      "ast": 815,
      "Ġpoint": 816,
      "Ġ\"": 817,
      "Ġdo": 818,
      "fore": 819,
      "Ġdefined": 820,
      "ort": 821,
      "ove": 822,
      "Ġuse": 823,
      "ĠIt": 824,
      "ism": 825,
      "Ġorder": 826,
      "gh": 827,
      "sis": 828,
      "Ġev": 829,
      "Ġtrans": 830,
      "Ġconsider": 831,
      "ample": 832,
      "Ġmap": 833,
      "ue": 834,
      "Ġfact": 835,
      "imension": 836,
      "nder": 837,
      "Ġevery": 838,
      "Ġsame": 839,
      "respond": 840,
      "Ġve": 841,
      "Ġreg": 842,
      "ord": 843,
      "Ġoper": 844,
      "ces": 845,
      "lement": 846,
      "ced": 847,
      "Ġen": 848,
      "Ġhol": 849,
      "ied": 850,
      "Ġcorrespond": 851,
      "ĠFigure": 852,
      "Ġthese": 853,
      "Î¸": 854,
      "ÏĢ": 855,
      "Ġusing": 856,
      "Ġproper": 857,
      "Ġlim": 858,
      "Ġgeneral": 859,
      "vi": 860,
      "amet": 861,
      "Ġdec": 862,
      "ark": 863,
      "Ġprov": 864,
      "Ġestim": 865,
      "Ġ7": 866,
      "omorph": 867,
      "Ġclass": 868,
      "ÏĦ": 869,
      "âŁ©": 870,
      "ost": 871,
      "ĠProposition": 872,
      "ser": 873,
      "rix": 874,
      "ents": 875,
      "00": 876,
      "ld": 877,
      "Ġro": 878,
      "Ì¸": 879,
      "ĠBy": 880,
      "ion": 881,
      "Ġout": 882,
      "Ġgroup": 883,
      "Ġfinite": 884,
      "Ġed": 885,
      "ĠâĪļ": 886,
      "Ġdistrib": 887,
      "Âµ": 888,
      "Î²": 889,
      "ĠâŁ¨": 890,
      "Ġext": 891,
      "ĠÎ£": 892,
      "een": 893,
      "Ġcomput": 894,
      "etween": 895,
      "ĠSince": 896,
      "Ġ8": 897,
      "ack": 898,
      "Ġbetween": 899,
      "now": 900,
      "ia": 901,
      "cess": 902,
      "Ġdisc": 903,
      "Ïĥ": 904,
      "Ġloc": 905,
      "our": 906,
      "ization": 907,
      "Ġunder": 908,
      "au": 909,
      "Ġprob": 910,
      "ption": 911,
      "les": 912,
      "Ġbas": 913,
      "Î³": 914,
      "Ġpl": 915,
      "Ġmeas": 916,
      "Ġsubs": 917,
      "Ġmatrix": 918,
      "Ġvector": 919,
      "ĠThere": 920,
      "'s": 921,
      "Ġelement": 922,
      "Ġrec": 923,
      "fficient": 924,
      "Ġthan": 925,
      "Ġresult": 926,
      "efin": 927,
      "ĠâĪ©": 928,
      "Ġresults": 929,
      "Ġanal": 930,
      "are": 931,
      "Ġabove": 932,
      "Ġpartic": 933,
      "Ġsee": 934,
      "Ġmore": 935,
      "ould": 936,
      "tial": 937,
      "Ġsequ": 938,
      "Ġconst": 939,
      "Ġdat": 940,
      "ign": 941,
      "Ġexists": 942,
      "10": 943,
      "âĪŀ": 944,
      "hod": 945,
      "geb": 946,
      "xt": 947,
      "âĢ¢": 948,
      "plic": 949,
      "ĠSection": 950,
      "ide": 951,
      "ĠÌ¸": 952,
      "Ġrepresent": 953,
      "Ġcontain": 954,
      "ĠÎ¦": 955,
      "age": 956,
      "ĠCon": 957,
      "ize": 958,
      "mm": 959,
      "ted": 960,
      "Ġsince": 961,
      "Ġparamet": 962,
      "iqu": 963,
      "ĠÎĽ": 964,
      "Ġman": 965,
      "ulti": 966,
      "Ġmethod": 967,
      "ip": 968,
      "out": 969,
      "ĠâĬĤ": 970,
      "andom": 971,
      "Ġbut": 972,
      "Ġoptim": 973,
      "ke": 974,
      "Ġpoly": 975,
      "ðĿĳ": 976,
      "ever": 977,
      "Ġcur": 978,
      "Ġï£´": 979,
      "Ïģ": 980,
      "Ġ;": 981,
      "Ġlar": 982,
      "ian": 983,
      "Ġdistribution": 984,
      "nt": 985,
      "ized": 986,
      "Ġdefine": 987,
      "vari": 988,
      "Ġâĸ": 989,
      "Ġmay": 990,
      "Ġsection": 991,
      "Î´": 992,
      "Ġdenote": 993,
      "ival": 994,
      "ilar": 995,
      "Ġlinear": 996,
      "Ġrandom": 997,
      "ĠÎº": 998,
      "Î¾": 999,
      "ann": 1000,
      "11": 1001,
      "est": 1002,
      "Ġtyp": 1003,
      "âĨĴ": 1004,
      "Ġfunctions": 1005,
      "Ġstate": 1006,
      "Ġdep": 1007,
      "sitive": 1008,
      "Ġmulti": 1009,
      "tical": 1010,
      "Ġsec": 1011,
      "ower": 1012,
      "âī": 1013,
      "Ġprobability": 1014,
      "Ġpoints": 1015,
      "ected": 1016,
      "equ": 1017,
      "Ġoperator": 1018,
      "âĦ¦": 1019,
      "Ġinto": 1020,
      "sed": 1021,
      "Ġsmall": 1022,
      "ĠThus": 1023,
      "rodu": 1024,
      "Ġ))": 1025,
      "Ġpr": 1026,
      "bit": 1027,
      "Ġconver": 1028,
      "olog": 1029,
      "Ġprove": 1030,
      "Ġstruct": 1031,
      "pt": 1032,
      "Ġused": 1033,
      "ory": 1034,
      "Ġpat": 1035,
      "air": 1036,
      "low": 1037,
      "Ġminim": 1038,
      "tinu": 1039,
      "ĠTo": 1040,
      "Ġmax": 1041,
      "ors": 1042,
      "12": 1043,
      "vel": 1044,
      "ĠSu": 1045,
      "Ġdefinition": 1046,
      "Ġparticular": 1047,
      "Ġdesc": 1048,
      "Ġdata": 1049,
      "Ġtak": 1050,
      "int": 1051,
      "Ġcho": 1052,
      "Ġboth": 1053,
      "ating": 1054,
      "ĠDefin": 1055,
      "Ġnorm": 1056,
      "Ġcol": 1057,
      "Ġimp": 1058,
      "Ġrem": 1059,
      "Ġprocess": 1060,
      ")|": 1061,
      "ero": 1062,
      "Ġnow": 1063,
      "Ġconstant": 1064,
      "uction": 1065,
      "Ġsupp": 1066,
      "Ġknow": 1067,
      "Ġanaly": 1068,
      "Ïī": 1069,
      "ĠNote": 1070,
      "Ġfix": 1071,
      "Ġconn": 1072,
      "gebra": 1073,
      "Îµ": 1074,
      "Ġcomplex": 1075,
      "omial": 1076,
      "Ġequival": 1077,
      "Ġmeasure": 1078,
      "Ġdeg": 1079,
      "over": 1080,
      "Ġbec": 1081,
      "ĠÄ": 1082,
      "Ġinc": 1083,
      "Ġtri": 1084,
      "Ġtheorem": 1085,
      "ication": 1086,
      "Ġformul": 1087,
      "ures": 1088,
      "etric": 1089,
      "Ġimpl": 1090,
      "Ġem": 1091,
      "Ġnod": 1092,
      "Ġwell": 1093,
      "Ġpap": 1094,
      "sible": 1095,
      "ail": 1096,
      "ĠâĪª": 1097,
      "ix": 1098,
      "ual": 1099,
      "par": 1100,
      "ving": 1101,
      "epend": 1102,
      "Ġdire": 1103,
      "Ġpos": 1104,
      "Ġwork": 1105,
      "Ġassume": 1106,
      "Ġsequence": 1107,
      "ĠAl": 1108,
      "omorphism": 1109,
      "âĢ²": 1110,
      "Ġcorresponding": 1111,
      "clud": 1112,
      "Ã©": 1113,
      "Ġdifferent": 1114,
      "Ġ10": 1115,
      "Ġequation": 1116,
      "Ġobser": 1117,
      "Ġvalue": 1118,
      "sing": 1119,
      "ĠâĪĩ": 1120,
      "Ġholds": 1121,
      "aces": 1122,
      "Ġimplies": 1123,
      "Ġcall": 1124,
      "Ġprodu": 1125,
      "Ġpositive": 1126,
      "Ġder": 1127,
      "Ġsecond": 1128,
      "ĠâŁ©": 1129,
      "Ġneed": 1130,
      "owever": 1131,
      "Ġmaxim": 1132,
      "ne": 1133,
      "Ġcomm": 1134,
      "Ïķ": 1135,
      "Ġsing": 1136,
      "ob": 1137,
      "Ġsur": 1138,
      "Ġpaper": 1139,
      "formation": 1140,
      "âĦĵ": 1141,
      "ile": 1142,
      "ten": 1143,
      "ject": 1144,
      "Ġup": 1145,
      "Ġag": 1146,
      "Ġdepend": 1147,
      "Ġreal": 1148,
      "put": 1149,
      "Ġ9": 1150,
      "Ġspec": 1151,
      "Ġ\\": 1152,
      "see": 1153,
      "ĠÏĩ": 1154,
      "Ġcontinu": 1155,
      "ii": 1156,
      "Ġij": 1157,
      "ĠâĪ¼": 1158,
      "Ġapproxim": 1159,
      "Ġdoes": 1160,
      "Ġexample": 1161,
      "Ġrequ": 1162,
      "Î·": 1163,
      "Ġwas": 1164,
      "urther": 1165,
      "Ġer": 1166,
      "als": 1167,
      "tex": 1168,
      "ique": 1169,
      "Ġpair": 1170,
      "tices": 1171,
      "Ġdimension": 1172,
      "ved": 1173,
      "old": 1174,
      "ases": 1175,
      "ĠâĬĨ": 1176,
      "Ġappl": 1177,
      "Ġmost": 1178,
      "13": 1179,
      "Ġtheir": 1180,
      "ause": 1181,
      "ĠMore": 1182,
      "Ġchar": 1183,
      "Ġredu": 1184,
      "Ġinequ": 1185,
      "nomial": 1186,
      "ive": 1187,
      "ampl": 1188,
      "Ġbounded": 1189,
      "eld": 1190,
      "ice": 1191,
      "ependent": 1192,
      "Ġâĸ¡": 1193,
      "ĥĹ": 1194,
      "Ġpath": 1195,
      "Ġstud": 1196,
      "Ġterms": 1197,
      "ood": 1198,
      "Ġcompon": 1199,
      "ectively": 1200,
      "Ġsign": 1201,
      ")(": 1202,
      "Ġâĭ": 1203,
      "Ġet": 1204,
      "Ġdeterm": 1205,
      "Ġstructure": 1206,
      "ĠTherefore": 1207,
      "wise": 1208,
      "ger": 1209,
      "Ġpresent": 1210,
      "Ġ(âĪĴ": 1211,
      "Ġlarge": 1212,
      "Ġpolynomial": 1213,
      "ens": 1214,
      "nce": 1215,
      "Ġstep": 1216,
      "Ġinst": 1217,
      "etwork": 1218,
      "Ġacc": 1219,
      "Ġclos": 1220,
      "Ġidenti": 1221,
      "Ġget": 1222,
      "ĠðĿĳ": 1223,
      "Ġintrodu": 1224,
      "Ġsatisfy": 1225,
      "hed": 1226,
      "Ġref": 1227,
      "ĠDefinition": 1228,
      "Ġintegr": 1229,
      "Ġhom": 1230,
      "oci": 1231,
      "ĠHence": 1232,
      "gy": 1233,
      "Ïµ": 1234,
      "Ġarg": 1235,
      "ĠÎ¶": 1236,
      "sum": 1237,
      "Î½": 1238,
      "Ġvertices": 1239,
      "ex": 1240,
      "ry": 1241,
      "Ġobtained": 1242,
      "ables": 1243,
      "ÏĪ": 1244,
      "ough": 1245,
      "ily": 1246,
      "Ġexist": 1247,
      "âĪĨ": 1248,
      "20": 1249,
      "Ġwr": 1250,
      "14": 1251,
      "Ġvertex": 1252,
      "Ġvalues": 1253,
      "Ġlat": 1254,
      "ĠâĢ²âĢ²": 1255,
      "Ġsimilar": 1256,
      "Ġdenot": 1257,
      "Ġran": 1258,
      "Ġboundary": 1259,
      "loc": 1260,
      "ks": 1261,
      "eng": 1262,
      "15": 1263,
      "Ġnetwork": 1264,
      "Ġ12": 1265,
      "not": 1266,
      "Ġdom": 1267,
      "Ġalgebra": 1268,
      "its": 1269,
      "Ġassumption": 1270,
      "sid": 1271,
      "Ġconditions": 1272,
      "Ġlocal": 1273,
      "Ġdia": 1274,
      "Ġfind": 1275,
      "Ġent": 1276,
      "ays": 1277,
      "Ġfixed": 1278,
      "ered": 1279,
      "action": 1280,
      "acter": 1281,
      "gram": 1282,
      "ech": 1283,
      "ell": 1284,
      "Ġassoci": 1285,
      "me": 1286,
      "Ġerr": 1287,
      "rough": 1288,
      "vious": 1289,
      ")-": 1290,
      "Ġtype": 1291,
      "Ġperform": 1292,
      "Ġbeen": 1293,
      "ft": 1294,
      "ature": 1295,
      "eed": 1296,
      "istic": 1297,
      "ÏĨ": 1298,
      "Ġend": 1299,
      "Ġzero": 1300,
      "aus": 1301,
      "ĠNow": 1302,
      "Ġindependent": 1303,
      "Ġrespectively": 1304,
      "Ġdescrib": 1305,
      "valu": 1306,
      "Ġleast": 1307,
      "ational": 1308,
      "Ġsatisfies": 1309,
      "ist": 1310,
      "Ġá": 1311,
      "ollary": 1312,
      "Ġfr": 1313,
      "ern": 1314,
      "Îĵ": 1315,
      "Ġedge": 1316,
      "âī¤": 1317,
      "Ġrespect": 1318,
      "ov": 1319,
      "Ġderiv": 1320,
      "ential": 1321,
      "ically": 1322,
      "Ġcharacter": 1323,
      "16": 1324,
      "Ġthey": 1325,
      "Ġinf": 1326,
      "Ġsymm": 1327,
      "Ġeig": 1328,
      "tice": 1329,
      "hen": 1330,
      "ength": 1331,
      "und": 1332,
      "ull": 1333,
      "ĠHowever": 1334,
      "yn": 1335,
      "Ġâ©": 1336,
      "cy": 1337,
      "Ġinequality": 1338,
      "Ġoptimal": 1339,
      "Ġsize": 1340,
      "ĠâĨ": 1341,
      "Ġcontr": 1342,
      "..": 1343,
      "Ġsets": 1344,
      "vers": 1345,
      "ĠSupp": 1346,
      "ym": 1347,
      "Ġge": 1348,
      "ness": 1349,
      "ĠRem": 1350,
      "con": 1351,
      "âĪĩ": 1352,
      "Ġexact": 1353,
      "Ġequivalent": 1354,
      "ĠÂ±": 1355,
      "Ġtop": 1356,
      "tr": 1357,
      "vex": 1358,
      "iform": 1359,
      "âĪĤ": 1360,
      "here": 1361,
      "hes": 1362,
      "bin": 1363,
      "Ġmust": 1364,
      "inc": 1365,
      "Ġmain": 1366,
      "ish": 1367,
      "Ġsum": 1368,
      "Ġstand": 1369,
      "Ġeigen": 1370,
      "Ġcontinuous": 1371,
      "ib": 1372,
      "Ġtheory": 1373,
      "19": 1374,
      "ĠâĪ§": 1375,
      "Ġini": 1376,
      "Ġsimple": 1377,
      "Ġaut": 1378,
      "ag": 1379,
      "ĠâĪĢ": 1380,
      "Ġthus": 1381,
      "Ġright": 1382,
      "Ġsubset": 1383,
      "ooth": 1384,
      "Ġph": 1385,
      "ĠÎ¨": 1386,
      "atur": 1387,
      "Ġaf": 1388,
      "Ġsup": 1389,
      "ĠAssum": 1390,
      "Ġcou": 1391,
      "}.": 1392,
      "Ġconsis": 1393,
      "Ġexpres": 1394,
      "ĠCor": 1395,
      "17": 1396,
      "Ġnew": 1397,
      "Ġdetermin": 1398,
      "Ġhy": 1399,
      "iction": 1400,
      "Ġshown": 1401,
      "sequ": 1402,
      "Ġcod": 1403,
      "ule": 1404,
      "gence": 1405,
      "Ġedges": 1406,
      "ĠRemark": 1407,
      "ology": 1408,
      "Ġpossible": 1409,
      "Ġpropo": 1410,
      "Ġvariables": 1411,
      "Ġconstrain": 1412,
      "ĠMoreover": 1413,
      "Ġproperties": 1414,
      "Ġelements": 1415,
      "Ġmon": 1416,
      "Ġunique": 1417,
      "ĠâĥĹ": 1418,
      "Ġbecause": 1419,
      "ĠSuppose": 1420,
      "Ġproperty": 1421,
      "lying": 1422,
      "Ġlength": 1423,
      "Ġeas": 1424,
      "Ġeven": 1425,
      "ĠÅ": 1426,
      "Ġlimit": 1427,
      "Ġthree": 1428,
      "Ġaction": 1429,
      "Ġhand": 1430,
      "Ġinfin": 1431,
      "ful": 1432,
      "variant": 1433,
      "Ġ20": 1434,
      "Ġam": 1435,
      "imensional": 1436,
      "ning": 1437,
      "Ġincre": 1438,
      "round": 1439,
      "ike": 1440,
      "get": 1441,
      "Ġindu": 1442,
      "ĠEx": 1443,
      "Ġdegree": 1444,
      "Ġwould": 1445,
      "ement": 1446,
      "Ġgives": 1447,
      "Ġshows": 1448,
      "Ġdirect": 1449,
      "Ġproj": 1450,
      "Ġpart": 1451,
      "ĠAn": 1452,
      "Ġcalled": 1453,
      "Ġparameter": 1454,
      "onal": 1455,
      "Ġlin": 1456,
      "Ġfield": 1457,
      "ĠÎł": 1458,
      "Ġsche": 1459,
      "elds": 1460,
      "ĠâĭĨ": 1461,
      "Ġcontro": 1462,
      "tern": 1463,
      "oint": 1464,
      "Ġuniform": 1465,
      "Ġfe": 1466,
      "18": 1467,
      "olic": 1468,
      "Ġassociated": 1469,
      "Ġcy": 1470,
      "Ġsem": 1471,
      "},": 1472,
      "cc": 1473,
      "ear": 1474,
      "Ġerror": 1475,
      "Ġdiscus": 1476,
      "red": 1477,
      "ding": 1478,
      "line": 1479,
      "ral": 1480,
      "Ġbased": 1481,
      "Ġinitial": 1482,
      "Ġscal": 1483,
      "dimensional": 1484,
      "ible": 1485,
      "ither": 1486,
      "Ġsmooth": 1487,
      "ck": 1488,
      "art": 1489,
      "tal": 1490,
      "Ġwhile": 1491,
      "ub": 1492,
      "Ġclosed": 1493,
      "Ġhence": 1494,
      "ities": 1495,
      "Ġstandard": 1496,
      "Ġrequire": 1497,
      "Ġrestr": 1498,
      "Ġequal": 1499,
      "Ġhyper": 1500,
      "ĠCorollary": 1501,
      "Ġstates": 1502,
      "Ġway": 1503,
      "Ġinformation": 1504,
      "Ġproduct": 1505,
      "efficient": 1506,
      "Ġleft": 1507,
      "Ġformula": 1508,
      "ĠÎĺ": 1509,
      "Ġrate": 1510,
      "ynam": 1511,
      "Ġallow": 1512,
      "Ġthrough": 1513,
      "Ġargum": 1514,
      "antum": 1515,
      "one": 1516,
      "Ġï£¬": 1517,
      "Ġapproach": 1518,
      "lear": 1519,
      "Ġfam": 1520,
      "Ġnormal": 1521,
      "Ġ11": 1522,
      "Ġextend": 1523,
      "Ġregular": 1524,
      "Ġnatur": 1525,
      "Ġmany": 1526,
      "ulation": 1527,
      "Ġmetric": 1528,
      "Ġconstruction": 1529,
      "mod": 1530,
      "Ġconstruct": 1531,
      "ven": 1532,
      "ics": 1533,
      "Ġconvex": 1534,
      "ides": 1535,
      "Ġï£·": 1536,
      "Ġlower": 1537,
      "Ġconnected": 1538,
      "urn": 1539,
      "Ġaddition": 1540,
      "Ġremain": 1541,
      "Ġser": 1542,
      "Ġcontains": 1543,
      "ighb": 1544,
      "ategor": 1545,
      "Ġeff": 1546,
      "Ġcoefficient": 1547,
      "Ġsurf": 1548,
      "inal": 1549,
      "anti": 1550,
      "otic": 1551,
      "usion": 1552,
      "Ġcomplete": 1553,
      "rop": 1554,
      "ants": 1555,
      "amples": 1556,
      "ments": 1557,
      "ects": 1558,
      "gn": 1559,
      "ane": 1560,
      "Ġide": 1561,
      "Ġsetting": 1562,
      "Ġcompact": 1563,
      "Ġdx": 1564,
      "pper": 1565,
      "Ġequations": 1566,
      "Ġcases": 1567,
      "tition": 1568,
      "ange": 1569,
      "Ġmean": 1570,
      "val": 1571,
      "ÃĹ": 1572,
      "com": 1573,
      "the": 1574,
      "ĠFin": 1575,
      "Ġknown": 1576,
      "mma": 1577,
      "iew": 1578,
      "Ġsolutions": 1579,
      "Ġsufficient": 1580,
      "Ġunit": 1581,
      "vial": 1582,
      "Ġmo": 1583,
      "Ġwhose": 1584,
      "Ġanalysis": 1585,
      "ordin": 1586,
      "rices": 1587,
      "Ġlemma": 1588,
      "vol": 1589,
      "Ġquantum": 1590,
      "Ġcorre": 1591,
      "Ġyi": 1592,
      "Ġestimate": 1593,
      "Ġiter": 1594,
      "ward": 1595,
      "Ġstudy": 1596,
      "Ġprevious": 1597,
      "tiv": 1598,
      "ros": 1599,
      "Ġarbit": 1600,
      "Ġest": 1601,
      "aim": 1602,
      "annel": 1603,
      "Ġ)(": 1604,
      "Ġconf": 1605,
      "Ġlo": 1606,
      "plicit": 1607,
      "ĠConsider": 1608,
      "ympt": 1609,
      "Ġnote": 1610,
      "Ġsingle": 1611,
      "Ġarbitr": 1612,
      "alc": 1613,
      "Ġ||": 1614,
      "verse": 1615,
      "bed": 1616,
      "Ġima": 1617,
      "clude": 1618,
      "gative": 1619,
      "Ġwor": 1620,
      "row": 1621,
      "ĠâĬķ": 1622,
      "Ġdecom": 1623,
      "Ġconvergence": 1624,
      "Ġâī¡": 1625,
      "omorphic": 1626,
      "Ġeither": 1627,
      "Ġnode": 1628,
      "Ġdomain": 1629,
      "Ġneighb": 1630,
      "ymptotic": 1631,
      "ifold": 1632,
      "Ġsen": 1633,
      "Ġpres": 1634,
      "Ġcent": 1635,
      "for": 1636,
      "Ġparameters": 1637,
      "ĠApp": 1638,
      "Ġprec": 1639,
      "Ġfl": 1640,
      "ĠHere": 1641,
      "Ġweight": 1642,
      "ier": 1643,
      "ha": 1644,
      "etry": 1645,
      "Ġmodels": 1646,
      "sp": 1647,
      "Ġrank": 1648,
      "Ġopen": 1649,
      "ĠOn": 1650,
      "Ġlead": 1651,
      "Ġsl": 1652,
      "Ġstrong": 1653,
      "Ġdynam": 1654,
      "Ġgraphs": 1655,
      "Ġgive": 1656,
      "Ġcombin": 1657,
      "cle": 1658,
      "Ġwrite": 1659,
      "Ġupper": 1660,
      "âŁ¨": 1661,
      "ings": 1662,
      "ĠFrom": 1663,
      "Ġrepresentation": 1664,
      "])": 1665,
      "Ġweak": 1666,
      "ner": 1667,
      "The": 1668,
      "Ġconc": 1669,
      "Ġpower": 1670,
      "Ġsystems": 1671,
      "Ġlevel": 1672,
      "iven": 1673,
      "echn": 1674,
      "ĠâĮ": 1675,
      "Ġtree": 1676,
      "lection": 1677,
      "Ġdistance": 1678,
      "Ġchannel": 1679,
      "asing": 1680,
      "ific": 1681,
      "Ġorig": 1682,
      "Ġdiv": 1683,
      "Ġnodes": 1684,
      "Ġsay": 1685,
      "Ġsupport": 1686,
      "Ġexpl": 1687,
      "Î£": 1688,
      "sive": 1689,
      "Ġhere": 1690,
      "Ġener": 1691,
      "ĠRe": 1692,
      "Ġspect": 1693,
      "to": 1694,
      "ecess": 1695,
      "Ġfactor": 1696,
      "Ġbelow": 1697,
      "Ġdiscre": 1698,
      "Ġadd": 1699,
      "Ġcoordin": 1700,
      "Ġsym": 1701,
      "ĠFurther": 1702,
      "Ġlast": 1703,
      "Ġinters": 1704,
      "Ġgenerated": 1705,
      "abel": 1706,
      "Ġvariable": 1707,
      "ually": 1708,
      "Ġquanti": 1709,
      "ording": 1710,
      "Ġcalc": 1711,
      ")/": 1712,
      "ertain": 1713,
      "Ġasymptotic": 1714,
      "Ġgl": 1715,
      "]).": 1716,
      "sity": 1717,
      "ĠCom": 1718,
      "Ġgo": 1719,
      "Ġmethods": 1720,
      "Ġâ©½": 1721,
      "ately": 1722,
      "Îº": 1723,
      "Ġhow": 1724,
      "iod": 1725,
      "ton": 1726,
      "chie": 1727,
      "Ġbasis": 1728,
      "Ġbloc": 1729,
      "Ġroot": 1730,
      "ĠGiven": 1731,
      "Ġmeans": 1732,
      "Ġnatural": 1733,
      "Ġmatrices": 1734,
      "Ġmaps": 1735,
      "ĠFinally": 1736,
      "Ġproposed": 1737,
      "Ġidentif": 1738,
      "ĠâĬ¤": 1739,
      "Ġabout": 1740,
      "Ġtrue": 1741,
      "ĠÂ´": 1742,
      "ĠNe": 1743,
      "Ġhigh": 1744,
      "hood": 1745,
      "Ġachie": 1746,
      "ĠUsing": 1747,
      "Ġeigenvalu": 1748,
      "ind": 1749,
      "Ġenergy": 1750,
      "ug": 1751,
      "Ġcos": 1752,
      "Ġtherefore": 1753,
      "ently": 1754,
      "Ġcost": 1755,
      "Ġproblems": 1756,
      "Ġgeom": 1757,
      "Ġthem": 1758,
      "Ġpartition": 1759,
      "ĠË": 1760,
      "jective": 1761,
      "ified": 1762,
      "Ġla": 1763,
      "ĠRec": 1764,
      "Ġbounds": 1765,
      "Ġcomponent": 1766,
      "Ġcurve": 1767,
      "Ġtechn": 1768,
      "lect": 1769,
      "Ġ)|": 1770,
      "ĠOur": 1771,
      "Ġindex": 1772,
      "Ġchoice": 1773,
      "Ġwithout": 1774,
      "Î¶": 1775,
      "Ġrelation": 1776,
      "Ġvery": 1777,
      "Ġspaces": 1778,
      "Ġexpon": 1779,
      "Ġgrad": 1780,
      "Ġche": 1781,
      "Ġnext": 1782,
      "22": 1783,
      "Ġnecess": 1784,
      "Ġ'": 1785,
      "ased": 1786,
      "ÎĽ": 1787,
      "Ġobserv": 1788,
      "Ġcontrol": 1789,
      "Ġprim": 1790,
      "Ġcategor": 1791,
      "Ġapproximation": 1792,
      "Ġinfinite": 1793,
      "Ġfamily": 1794,
      "sian": 1795,
      "Ġsin": 1796,
      "Ġalong": 1797,
      "Ġtake": 1798,
      "ene": 1799,
      "ĠâĪħ": 1800,
      "Ġdenotes": 1801,
      "Ġside": 1802,
      "ave": 1803,
      "group": 1804,
      "ĠSo": 1805,
      "Ġregion": 1806,
      "Ġtotal": 1807,
      "Ġsymmetric": 1808,
      "mit": 1809,
      "Ġfurther": 1810,
      ")]": 1811,
      "Ġstrate": 1812,
      "Ġâĩ": 1813,
      "ute": 1814,
      "log": 1815,
      "oss": 1816,
      "Ġtre": 1817,
      "ify": 1818,
      "ĠâĪĴâĨĴ": 1819,
      "Ġdetail": 1820,
      "joint": 1821,
      "iter": 1822,
      "ĠCh": 1823,
      "Ġnotation": 1824,
      "Ġcir": 1825,
      "Ġcompute": 1826,
      "more": 1827,
      "ĠSim": 1828,
      "Ġbel": 1829,
      "Ġcomponents": 1830,
      "Ġembed": 1831,
      "Ġindic": 1832,
      "Ġdue": 1833,
      "most": 1834,
      "ences": 1835,
      "Ġinvariant": 1836,
      "Ġgu": 1837,
      "pping": 1838,
      "Ġstat": 1839,
      "Ġsatisfying": 1840,
      "ĠII": 1841,
      "ĠSp": 1842,
      "ĠFirst": 1843,
      "Î¦": 1844,
      "man": 1845,
      "Ġextension": 1846,
      "Ġalgorithms": 1847,
      "Ġimport": 1848,
      "led": 1849,
      "ision": 1850,
      "ules": 1851,
      "Ġthose": 1852,
      "Ġscheme": 1853,
      "Ġapply": 1854,
      "Ġnumer": 1855,
      "erence": 1856,
      "Ġread": 1857,
      "Ġafter": 1858,
      "ets": 1859,
      "Ġtransform": 1860,
      "Ġpri": 1861,
      "Ġarbitrary": 1862,
      "21": 1863,
      "Ġinteger": 1864,
      "ency": 1865,
      "arch": 1866,
      "Ġargument": 1867,
      "ĠWhen": 1868,
      "Ġfree": 1869,
      "ĠInd": 1870,
      "Ġtriang": 1871,
      "Ġrepl": 1872,
      "ead": 1873,
      "ĠĠ": 1874,
      "Ġexpression": 1875,
      "verage": 1876,
      "ĠâĢł": 1877,
      "Ġdt": 1878,
      "ĠâĬ¥": 1879,
      "Ġshould": 1880,
      "Ġgroups": 1881,
      "Ġocc": 1882,
      "Ġsepar": 1883,
      "Ġbeha": 1884,
      "Ġappear": 1885,
      "Ġdensity": 1886,
      "up": 1887,
      "mon": 1888,
      "Ġdiagram": 1889,
      "ernel": 1890,
      "edi": 1891,
      "Ġclassical": 1892,
      "Ġinput": 1893,
      "Ġoperators": 1894,
      "Ġbeing": 1895,
      "plit": 1896,
      "Ġlear": 1897,
      "Ġexplicit": 1898,
      "Ġconsid": 1899,
      "Ġspecial": 1900,
      "ax": 1901,
      "Ġï£¯": 1902,
      "Ġclaim": 1903,
      "Ġtran": 1904,
      "ys": 1905,
      "Ġsurface": 1906,
      "abl": 1907,
      "Ġproved": 1908,
      "Ġbi": 1909,
      "Ġcap": 1910,
      "Ġ13": 1911,
      "ĠAlgorithm": 1912,
      "Ġcannot": 1913,
      "Ġbr": 1914,
      "Ġke": 1915,
      "Ġagain": 1916,
      "Ġloss": 1917,
      "inary": 1918,
      "Ġsqu": 1919,
      "Ġconsidered": 1920,
      "Ġisomorphism": 1921,
      "ided": 1922,
      "Ġï£º": 1923,
      "Ġclear": 1924,
      "Ġmaximum": 1925,
      "ĠAssume": 1926,
      "Ġdecomposition": 1927,
      "mis": 1928,
      "Ġdescribed": 1929,
      "Ġvia": 1930,
      "ĠEq": 1931,
      "Ġlabel": 1932,
      "Ġ((": 1933,
      "23": 1934,
      "orphism": 1935,
      "âĨĴâĪŀ": 1936,
      "Ġ19": 1937,
      "ries": 1938,
      "Ġyields": 1939,
      ")âĪ¥": 1940,
      ")).": 1941,
      "ways": 1942,
      "25": 1943,
      "Ġperformance": 1944,
      "Ġprecise": 1945,
      "Ġcoefficients": 1946,
      "Ġinvol": 1947,
      "perim": 1948,
      "Ġinstance": 1949,
      "ĠThese": 1950,
      "Ġwere": 1951,
      "ĠGaus": 1952,
      "cept": 1953,
      "clusion": 1954,
      "24": 1955,
      "Ġchoose": 1956,
      "Ġenough": 1957,
      "Ġexactly": 1958,
      "Ġhold": 1959,
      "oid": 1960,
      "astic": 1961,
      "Ġperiod": 1962,
      "Ġversion": 1963,
      "Ġflow": 1964,
      "af": 1965,
      "âī¥": 1966,
      "Ġsense": 1967,
      "Ġdi": 1968,
      "Ġdirection": 1969,
      "Ġlike": 1970,
      "Ġpred": 1971,
      "Ġalways": 1972,
      "Ġir": 1973,
      "Ġrun": 1974,
      "Ġrelative": 1975,
      "uting": 1976,
      "Ġdiag": 1977,
      "Ġav": 1978,
      "Ġinterval": 1979,
      "velop": 1980,
      "Ġintegral": 1981,
      "Ġkernel": 1982,
      "eg": 1983,
      "Ġprojection": 1984,
      "ole": 1985,
      "och": 1986,
      "uch": 1987,
      "Ġframe": 1988,
      "ĠâĪ¨": 1989,
      "Ġstar": 1990,
      "ons": 1991,
      "Ġcalcul": 1992,
      "ĠOne": 1993,
      "Ġ..": 1994,
      "less": 1995,
      "Ġdenoted": 1996,
      "Ġcheck": 1997,
      "rict": 1998,
      "Ġestabl": 1999,
      "ĠðĿ": 2000,
      "ior": 2001,
      "acy": 2002,
      "ators": 2003,
      "Ġvectors": 2004,
      "til": 2005,
      "umn": 2006,
      "ult": 2007,
      "Ġ16": 2008,
      "linear": 2009,
      "read": 2010,
      "ok": 2011,
      "Ġinterp": 2012,
      "Ġcr": 2013,
      "Ġview": 2014,
      "Ġrelations": 2015,
      "Ġhyp": 2016,
      "Ġmake": 2017,
      "Ġconclude": 2018,
      "Ġexistence": 2019,
      "endix": 2020,
      "uc": 2021,
      "sc": 2022,
      "Ġcertain": 2023,
      "ĠWith": 2024,
      "Ġln": 2025,
      "Ġ#": 2026,
      "emp": 2027,
      "ĠRecall": 2028,
      "Ġstrict": 2029,
      "Ġsubgroup": 2030,
      "Ġimportant": 2031,
      "Ġperm": 2032,
      "Ġtra": 2033,
      "We": 2034,
      "Ġsuper": 2035,
      "Ġbund": 2036,
      "ĠExample": 2037,
      "ared": 2038,
      "estion": 2039,
      "Ġtimes": 2040,
      "izing": 2041,
      "Ġrow": 2042,
      "Ġhig": 2043,
      "ĠFurthermore": 2044,
      "Ġminimal": 2045,
      "Ġprovide": 2046,
      "Ġimm": 2047,
      "ret": 2048,
      "Ġbehavi": 2049,
      "Ġevalu": 2050,
      "osen": 2051,
      "Ġdim": 2052,
      "till": 2053,
      "ĠSt": 2054,
      "Ġcomplexity": 2055,
      "Ġquad": 2056,
      "Ġcomputation": 2057,
      "Ġorth": 2058,
      "Ġ([": 2059,
      "Ġcolumn": 2060,
      "Ġdiscrete": 2061,
      "Ġintroduce": 2062,
      "âĮ": 2063,
      "Ġoccur": 2064,
      "ante": 2065,
      "sequence": 2066,
      "Ġglob": 2067,
      "ental": 2068,
      "Ġrelated": 2069,
      "ensor": 2070,
      "ological": 2071,
      "itten": 2072,
      "Ġtor": 2073,
      "Ġdifferential": 2074,
      "Ġfound": 2075,
      "Ġimage": 2076,
      "Ġmaximal": 2077,
      "Ġ`": 2078,
      "Ġrefer": 2079,
      "Ġpot": 2080,
      "olution": 2081,
      "Ġ...,": 2082,
      "Ġatt": 2083,
      "pr": 2084,
      "Ġproced": 2085,
      "graph": 2086,
      "sif": 2087,
      "sign": 2088,
      "Ġchange": 2089,
      "Ġmanifold": 2090,
      "Ġlong": 2091,
      "ĠSimilar": 2092,
      "ility": 2093,
      "Ġï£«": 2094,
      "Ġï£Ń": 2095,
      "Ġcontrad": 2096,
      "otop": 2097,
      "Ġï£¸": 2098,
      "Ġï£¶": 2099,
      "ĠTable": 2100,
      "uted": 2101,
      "(âĪĴ": 2102,
      "Ġrad": 2103,
      "rest": 2104,
      "ĠâĻ": 2105,
      "Ġ14": 2106,
      "Ġchain": 2107,
      "Ġdual": 2108,
      "Ġsingular": 2109,
      "itive": 2110,
      "ON": 2111,
      "Ġmorphism": 2112,
      "Ġclasses": 2113,
      "ict": 2114,
      "Ġcould": 2115,
      "Ġaccording": 2116,
      "Ġ[?": 2117,
      "Ġblock": 2118,
      "Ġinduced": 2119,
      "Ġidentity": 2120,
      "Ġchosen": 2121,
      "ching": 2122,
      "Ġdevelop": 2123,
      "ĠTr": 2124,
      "Ġval": 2125,
      "arily": 2126,
      "Ġmultiplic": 2127,
      "ĠGaussian": 2128,
      "tri": 2129,
      "Ġneighbor": 2130,
      "son": 2131,
      "hom": 2132,
      "ired": 2133,
      "Ġnumbers": 2134,
      "rient": 2135,
      "Ġimpro": 2136,
      "ply": 2137,
      "Ġclust": 2138,
      "pos": 2139,
      "other": 2140,
      "ĠâĨĲ": 2141,
      "Ġdesign": 2142,
      "Ġnotion": 2143,
      "Ġanalog": 2144,
      "Ġemp": 2145,
      "ĠIndeed": 2146,
      "av": 2147,
      "duc": 2148,
      "igur": 2149,
      "tit": 2150,
      "Ġcell": 2151,
      "Ġestimates": 2152,
      "Ġbelong": 2153,
      "Ġreas": 2154,
      "Ġexperim": 2155,
      "ron": 2156,
      "Ġuniformly": 2157,
      "odes": 2158,
      "Ġback": 2159,
      "Ġinterest": 2160,
      "Ġcode": 2161,
      "Ïĩ": 2162,
      "Ġclose": 2163,
      "Ġguar": 2164,
      "Ġorient": 2165,
      "Ġalmost": 2166,
      ");": 2167,
      "ications": 2168,
      "izes": 2169,
      "Ġstill": 2170,
      "Ġstable": 2171,
      "Ġtrivial": 2172,
      "Ġaverage": 2173,
      "Ġjust": 2174,
      "Ġfull": 2175,
      "Ġcorresponds": 2176,
      "time": 2177,
      "Ġfour": 2178,
      "entially": 2179,
      "Ġgre": 2180,
      "side": 2181,
      "Ġeasy": 2182,
      "Ġprinc": 2183,
      "Ġequivalence": 2184,
      "ource": 2185,
      "Ġprogram": 2186,
      "Ġintroduced": 2187,
      "Ġcover": 2188,
      "Ġtest": 2189,
      "Ġquestion": 2190,
      "Ġsimpl": 2191,
      "Ġhypot": 2192,
      "Ġcurves": 2193,
      "assif": 2194,
      "Ġrecall": 2195,
      "Ġinclud": 2196,
      "Ġbefore": 2197,
      "ade": 2198,
      "dd": 2199,
      "Ġill": 2200,
      "Ġstatement": 2201,
      "Ġplay": 2202,
      "gether": 2203,
      "ivers": 2204,
      "Ġtogether": 2205,
      "Ġguarante": 2206,
      "26": 2207,
      "Ġrece": 2208,
      "sel": 2209,
      "Ġturn": 2210,
      "ustr": 2211,
      "Ġminimum": 2212,
      "):": 2213,
      "âĬ": 2214,
      "Ġstrategy": 2215,
      "Ġexamples": 2216,
      "Ġcategory": 2217,
      "Ġposition": 2218,
      "Ġimple": 2219,
      "rent": 2220,
      "Ġconstraints": 2221,
      "ritical": 2222,
      "Ġotherwise": 2223,
      "Ġirre": 2224,
      "Ġcoun": 2225,
      "Ġsubsp": 2226,
      "know": 2227,
      "Ġmom": 2228,
      "Ġoptimization": 2229,
      "sib": 2230,
      "zero": 2231,
      "Ġcros": 2232,
      "tically": 2233,
      "ick": 2234,
      "Ġnumerical": 2235,
      "Ġsample": 2236,
      "ĠCl": 2237,
      "Ġvan": 2238,
      "ĠNo": 2239,
      "Ġ(âĢ¢": 2240,
      "ount": 2241,
      "Ġconfigur": 2242,
      "Ġsufficiently": 2243,
      "lation": 2244,
      "ee": 2245,
      "Ġphase": 2246,
      "ĠPo": 2247,
      "text": 2248,
      "ances": 2249,
      "Ġ],": 2250,
      "Ġtransition": 2251,
      "Ġenc": 2252,
      "Ġseries": 2253,
      "Ġvol": 2254,
      "Ġsever": 2255,
      "vant": 2256,
      "Ġcommun": 2257,
      "Ġeasily": 2258,
      "Ġprocedure": 2259,
      ")),": 2260,
      "Ġ15": 2261,
      "Ġcontained": 2262,
      "bol": 2263,
      "Ġseveral": 2264,
      "Ġless": 2265,
      "Ġ},": 2266,
      "Ġwords": 2267,
      "jecture": 2268,
      "Ġintersection": 2269,
      "Ġquas": 2270,
      "ĠOb": 2271,
      "Ġmak": 2272,
      "Ġsuppose": 2273,
      "Ġconven": 2274,
      "ogene": 2275,
      "ĠHam": 2276,
      "27": 2277,
      "Ġexpected": 2278,
      "Ġassumptions": 2279,
      "Ġbu": 2280,
      "Ġact": 2281,
      "Ġwhether": 2282,
      "Ġconstraint": 2283,
      "Ġadj": 2284,
      "Ġdepends": 2285,
      "TI": 2286,
      "hesis": 2287,
      "ĠPr": 2288,
      "ochastic": 2289,
      "Ġfre": 2290,
      "amely": 2291,
      "28": 2292,
      "unctor": 2293,
      "ĠAppendix": 2294,
      "Ġlow": 2295,
      "work": 2296,
      "Ġglobal": 2297,
      "ius": 2298,
      "Ġrestriction": 2299,
      "Ġcycl": 2300,
      "rid": 2301,
      "Ġassign": 2302,
      "gin": 2303,
      "Ġdifference": 2304,
      "Ġoriginal": 2305,
      "olds": 2306,
      "Ġanother": 2307,
      "Ġapplied": 2308,
      "Ġnoise": 2309,
      "Ġwhat": 2310,
      "Ġcommon": 2311,
      "Ġ{(": 2312,
      "tics": 2313,
      "Ġrule": 2314,
      "wh": 2315,
      "Ġfil": 2316,
      "tivity": 2317,
      "Ġallows": 2318,
      "Ġsimply": 2319,
      "ik": 2320,
      "ink": 2321,
      "Ġbo": 2322,
      "Ġess": 2323,
      "Ġpreser": 2324,
      "Ġdecre": 2325,
      "Ġwithin": 2326,
      "Ġnegative": 2327,
      "tur": 2328,
      "Ġhigher": 2329,
      "Ġobserve": 2330,
      "Ġorbit": 2331,
      "Ġ}.": 2332,
      "Ġcompar": 2333,
      "Ġrequired": 2334,
      "ention": 2335,
      "bolic": 2336,
      "Ġsit": 2337,
      "Ġord": 2338,
      "order": 2339,
      "Ġillustr": 2340,
      "Ġclassif": 2341,
      "Ġáº": 2342,
      "elf": 2343,
      "Ġpairs": 2344,
      "Ġlattice": 2345,
      "Ġupd": 2346,
      "ras": 2347,
      "ages": 2348,
      "Ġlocally": 2349,
      "Ġcanon": 2350,
      "Ġel": 2351,
      "ilton": 2352,
      "Ġds": 2353,
      "ĠâĪŀ.": 2354,
      "Ġgeometric": 2355,
      "Ġsampl": 2356,
      "Ġimplement": 2357,
      "Ġstochastic": 2358,
      "Ġsatisfied": 2359,
      "Ġdistin": 2360,
      "Ġlearning": 2361,
      "Ġcontext": 2362,
      "Ġsumm": 2363,
      "ĠâĪŀ,": 2364,
      "Ġabs": 2365,
      "ĠEqu": 2366,
      "Ġimmedi": 2367,
      "30": 2368,
      "ansion": 2369,
      "Ġconj": 2370,
      "ĠGr": 2371,
      "Ġexpect": 2372,
      "known": 2373,
      "ĠInt": 2374,
      "Ġpresented": 2375,
      "Ġgradient": 2376,
      ")}": 2377,
      "Ġshall": 2378,
      "Ġoutput": 2379,
      "Ġreplac": 2380,
      "Ġauth": 2381,
      "Ġdistributions": 2382,
      "Ġproposition": 2383,
      "Ġlink": 2384,
      "ĠLie": 2385,
      "Ġcomputed": 2386,
      "Ġbecom": 2387,
      "Ġstatis": 2388,
      "ilib": 2389,
      "Ġtaking": 2390,
      "Ġtensor": 2391,
      "Ġodd": 2392,
      "Ġconverges": 2393,
      "Ġdetermined": 2394,
      "ĠSimilarly": 2395,
      "Ġbundle": 2396,
      "icted": 2397,
      "Ġvalid": 2398,
      "Ġconsists": 2399,
      "Ġconnection": 2400,
      "ĠÎ¹": 2401,
      "Ġreason": 2402,
      "Ġalgebraic": 2403,
      "Ġembedding": 2404,
      "ĠSte": 2405,
      "Ġdu": 2406,
      "Ġcoordinates": 2407,
      "Ġpolynomials": 2408,
      "Ġeigenvalues": 2409,
      "Ġframework": 2410,
      "Ġnecessary": 2411,
      "DE": 2412,
      "off": 2413,
      "variance": 2414,
      "Ġsplit": 2415,
      "Ġpermut": 2416,
      "Ġdynamics": 2417,
      "tig": 2418,
      "Ġmultiple": 2419,
      "Ġsymbol": 2420,
      "ips": 2421,
      "ĠLe": 2422,
      "pro": 2423,
      "ilibri": 2424,
      "Ġadditional": 2425,
      "aves": 2426,
      "cing": 2427,
