{"do_lower_case": true, "do_basic_tokenize": true, "never_split": null, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": null, "max_length": 512, "truncation": true, "name_or_path": "./vocabularies/trained_tokenizer/vocab.txt", "tokenizer_class": "BertTokenizer"}